# Numpy

### - Class1(25thMay2024)

# What is Numpy?
 
      - Numpy is an array/

      - Numerical Python: Fast , Used in all types of mathematical calculations
    
      - Why Numpy is easy and Fast: 
      - It peforms vectorizeed Operation

In [1]:
import numpy as np

# Creating numpy arrays
          - type casting a list 
          - arange()
          - array()
          - np.random.randint

In [2]:
arr = np.array(1,2,3,4,5,6,7,8,9)

TypeError: array() takes from 1 to 2 positional arguments but 9 were given

In [4]:
arr = np.array([1,2,3,4,5,6,7,8,9], dtype=float)
arr

array([1., 2., 3., 4., 5., 6., 7., 8., 9.])

In [5]:
arr.dtype

dtype('float64')

In [6]:
arr = np.array([1,2,3,4,5,6,7,8,9])
arr

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [7]:
arr.dtype

dtype('int32')

In [8]:
arr = np.array([1,2,3,4,5,6,7.0,8,9])
arr.dtype

dtype('float64')

In [9]:
#Type of object arr
print(type(arr))

# Type of data in arr
print(arr.dtype)

# Size of arr
print(arr.size)

#length of arr
print(len(arr))

# Shape of arr
print(arr.shape)



#dimension of arr
print(arr.ndim)

<class 'numpy.ndarray'>
float64
9
9
(9,)
1

arr1d = [1,2,3,4,5,6,7,8]
it is a one dimesnional array (1d array) >>>>>> Vector
Shape of vector will be represented in this way (8,)
There is no convcept of Row or Col when dealing in 1d array

# Array indexing and Slincing

In [10]:
arr1d = [1,2,3,4,5,6,7,8]

In [11]:
arr1d[4]

5

In [12]:
arr1d[-4]

5

In [13]:
arr1d[2:7]

[3, 4, 5, 6, 7]

# 2-Dimensional Array

In [14]:
arr2d = np.array([[1,2,3,4],[2,3,4,5],[3,4,5,6],[4,5,6,7],[5,6,7,8],[6,7,8,9]])
arr2d

array([[1, 2, 3, 4],
       [2, 3, 4, 5],
       [3, 4, 5, 6],
       [4, 5, 6, 7],
       [5, 6, 7, 8],
       [6, 7, 8, 9]])

In [15]:
arr1d = np.arange(1,20)
arr1d

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19])

In [16]:
#20= 4,5| 5,4,| 10,2|, 2,10| 20,1| 1,20

In [17]:
arr2d = np.arange(20).reshape(4,5)
arr2d

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [18]:
arr2d = np.arange(20).reshape(5,4)
arr2d

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [19]:
arr2d = np.arange(20).reshape(10,2)
arr2d

array([[ 0,  1],
       [ 2,  3],
       [ 4,  5],
       [ 6,  7],
       [ 8,  9],
       [10, 11],
       [12, 13],
       [14, 15],
       [16, 17],
       [18, 19]])

In [20]:
arr2d = np.arange(20).reshape(2,10)
arr2d

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]])

In [21]:
arr2d = np.random.randint(1,10,(6,6))
arr2d

array([[6, 3, 1, 7, 7, 9],
       [4, 6, 8, 7, 5, 7],
       [9, 5, 3, 4, 3, 4],
       [9, 8, 1, 6, 9, 4],
       [1, 9, 2, 1, 4, 3],
       [6, 3, 9, 6, 1, 4]])

In [22]:
arr1d = np.random.randint(1,10,(12,))
arr1d

array([4, 6, 8, 8, 8, 6, 4, 5, 1, 2, 4, 2])

# Indexing and Slicing of a 2-Dimensional Array

In [2]:
arr2d = np.arange(1,37).reshape(6,6)
arr2d

array([[ 1,  2,  3,  4,  5,  6],
       [ 7,  8,  9, 10, 11, 12],
       [13, 14, 15, 16, 17, 18],
       [19, 20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29, 30],
       [31, 32, 33, 34, 35, 36]])

In [3]:
# for 22
arr2d[3,3]

22

In [25]:
# for 36
arr2d[-1,-1] , arr2d[5,5], arr2d[5][5]

(36, 36, 36)

array [row, column]
 
array [startofrow:endofrow , startofcolumn: endofcolumns]

In [26]:
arr2d[2:5,2:4]

array([[15, 16],
       [21, 22],
       [27, 28]])

In [27]:
arr2d[2:4,1: ]

array([[14, 15, 16, 17, 18],
       [20, 21, 22, 23, 24]])

In [5]:
arr2d[:, :4]

array([[ 1,  2,  3,  4],
       [ 7,  8,  9, 10],
       [13, 14, 15, 16],
       [19, 20, 21, 22],
       [25, 26, 27, 28],
       [31, 32, 33, 34]])

In [29]:
arr2d[ : , 5: ]

array([[ 6],
       [12],
       [18],
       [24],
       [30],
       [36]])

In [4]:
arr2d[:,5]

# this is not slicing , this is indexing

array([ 6, 12, 18, 24, 30, 36])

In [31]:
arr2d[3,:3]

array([19, 20, 21])

In [32]:
arr2d[3:4,:3 ]

array([[19, 20, 21]])

# Vectorized Operation

In [33]:
lst  = [1,2,3,4,5,6,7,8,9,10]

# task: you need to create another list that contains the 
#       square of each element of given list

square_lst = []

for a in lst:
    square = a**2
    square_lst.append(square)
print(square_lst)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [34]:
square_lst = [a**2 for a in lst]
square_lst

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [35]:
arr = np.array(lst)
arr

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [36]:
arr**2

array([  1,   4,   9,  16,  25,  36,  49,  64,  81, 100])

In [37]:
arr

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [38]:
arr+10

array([11, 12, 13, 14, 15, 16, 17, 18, 19, 20])

In [39]:
arr*2

array([ 2,  4,  6,  8, 10, 12, 14, 16, 18, 20])

# Class2(26-May2024)

In [40]:
# creating a numpy array of all zeros (6 len)
zeros = np.zeros(6,dtype=int)
zeros

array([0, 0, 0, 0, 0, 0])

In [41]:
zeros = np.zeros((4,5),dtype=int)
zeros

array([[0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0]])

In [42]:
ones = np.ones(8)
ones

array([1., 1., 1., 1., 1., 1., 1., 1.])

In [43]:
ones = np.ones((8,8),dtype=int)
ones

array([[1, 1, 1, 1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1, 1, 1, 1]])

In [44]:
empty = np.empty(10)
empty

array([nan,  0.,  0.,  0.,  0.,  0.,  0.,  0.,  0.,  0.])

In [45]:
full = np.full((4,4), 10)
full

array([[10, 10, 10, 10],
       [10, 10, 10, 10],
       [10, 10, 10, 10],
       [10, 10, 10, 10]])

In [46]:
eye = np.eye(2)
eye

array([[1., 0.],
       [0., 1.]])

In [47]:
random_arr = np.random.randint(11,50,(6,6))
random_arr

array([[46, 35, 22, 29, 46, 19],
       [20, 43, 13, 40, 38, 43],
       [31, 35, 35, 21, 49, 49],
       [19, 44, 31, 31, 41, 21],
       [21, 14, 36, 49, 21, 43],
       [45, 17, 21, 40, 45, 38]])

In [48]:
full_like = np.full_like(random_arr,2.1)   # shape and datatype
full_like

array([[2, 2, 2, 2, 2, 2],
       [2, 2, 2, 2, 2, 2],
       [2, 2, 2, 2, 2, 2],
       [2, 2, 2, 2, 2, 2],
       [2, 2, 2, 2, 2, 2],
       [2, 2, 2, 2, 2, 2]])

### Changing Datatype of an existing array

In [49]:
arr = np.array([1, 2, 3, 4, 5])
print(arr.dtype)

int32

In [50]:
arr = arr.astype('float64')

#### Arithmetic with NumPy Arrays

In [51]:
arr1 = np.random.randint(1,100,(5,5))
print(arr1)

[[62 54 10 71 61]
 [74 61 80 30 16]
 [87 79 50 92  6]
 [87 44 21 86 92]
 [88 29 48 21 48]]

In [52]:
arr2 = np.arange(101,126).reshape(5,5)
arr2

array([[101, 102, 103, 104, 105],
       [106, 107, 108, 109, 110],
       [111, 112, 113, 114, 115],
       [116, 117, 118, 119, 120],
       [121, 122, 123, 124, 125]])

In [53]:
arr1 + arr2

array([[163, 156, 113, 175, 166],
       [180, 168, 188, 139, 126],
       [198, 191, 163, 206, 121],
       [203, 161, 139, 205, 212],
       [209, 151, 171, 145, 173]])

In [54]:
arr1*arr2

array([[ 6262,  5508,  1030,  7384,  6405],
       [ 7844,  6527,  8640,  3270,  1760],
       [ 9657,  8848,  5650, 10488,   690],
       [10092,  5148,  2478, 10234, 11040],
       [10648,  3538,  5904,  2604,  6000]])

In [55]:
arr1/arr2

array([[0.61386139, 0.52941176, 0.09708738, 0.68269231, 0.58095238],
       [0.69811321, 0.57009346, 0.74074074, 0.27522936, 0.14545455],
       [0.78378378, 0.70535714, 0.44247788, 0.80701754, 0.05217391],
       [0.75      , 0.37606838, 0.1779661 , 0.72268908, 0.76666667],
       [0.72727273, 0.23770492, 0.3902439 , 0.16935484, 0.384     ]])

# Boolean Indexing

In [56]:
arr = np.array([1,2,3,4,5,6,7,8,9,10])
arr

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [57]:
bool_arr = [False, True, True, False, True, False, True, True, True,False]

In [58]:
arr[bool_arr]

array([2, 3, 5, 7, 8, 9])

In [6]:
arr[[False, True, True, False, True, False, True, True, True,False]]

NameError: name 'arr' is not defined

In [60]:
arr%2==0

array([False,  True, False,  True, False,  True, False,  True, False,
        True])

In [61]:
arr[ arr%2==0    ]

array([ 2,  4,  6,  8, 10])

In [62]:
arr[arr>5]

array([ 6,  7,  8,  9, 10])

In [63]:
arr[(arr>5) & (arr<8)]

array([6, 7])

In [64]:
arr1

array([[62, 54, 10, 71, 61],
       [74, 61, 80, 30, 16],
       [87, 79, 50, 92,  6],
       [87, 44, 21, 86, 92],
       [88, 29, 48, 21, 48]])

In [65]:
arr1[arr1%6==0]

array([54, 30,  6, 48, 48])

In [66]:
arr1[(arr1%5==0) | (arr1%2==0)]

array([62, 54, 10, 74, 80, 30, 16, 50, 92,  6, 44, 86, 92, 88, 48, 48])

In [67]:
arr1

array([[62, 54, 10, 71, 61],
       [74, 61, 80, 30, 16],
       [87, 79, 50, 92,  6],
       [87, 44, 21, 86, 92],
       [88, 29, 48, 21, 48]])

In [68]:
arr1[[4,2,0,3]]

array([[88, 29, 48, 21, 48],
       [87, 79, 50, 92,  6],
       [62, 54, 10, 71, 61],
       [87, 44, 21, 86, 92]])

In [69]:
arr1[:,[3,2,1]]

array([[71, 10, 54],
       [30, 80, 61],
       [92, 50, 79],
       [86, 21, 44],
       [21, 48, 29]])

In [70]:
arr1

array([[62, 54, 10, 71, 61],
       [74, 61, 80, 30, 16],
       [87, 79, 50, 92,  6],
       [87, 44, 21, 86, 92],
       [88, 29, 48, 21, 48]])

In [71]:
arr1.T

array([[62, 74, 87, 87, 88],
       [54, 61, 79, 44, 29],
       [10, 80, 50, 21, 48],
       [71, 30, 92, 86, 21],
       [61, 16,  6, 92, 48]])

### Universal Functions: Fast Element-Wise Array Functions

In [72]:
arr1

array([[62, 54, 10, 71, 61],
       [74, 61, 80, 30, 16],
       [87, 79, 50, 92,  6],
       [87, 44, 21, 86, 92],
       [88, 29, 48, 21, 48]])

In [73]:
np.where(arr1>50,50,arr1)

array([[50, 50, 10, 50, 50],
       [50, 50, 50, 30, 16],
       [50, 50, 50, 50,  6],
       [50, 44, 21, 50, 50],
       [50, 29, 48, 21, 48]])

# Concatinating Arrays/ Joining

In [74]:
arr1

array([[62, 54, 10, 71, 61],
       [74, 61, 80, 30, 16],
       [87, 79, 50, 92,  6],
       [87, 44, 21, 86, 92],
       [88, 29, 48, 21, 48]])

In [75]:
arr2

array([[101, 102, 103, 104, 105],
       [106, 107, 108, 109, 110],
       [111, 112, 113, 114, 115],
       [116, 117, 118, 119, 120],
       [121, 122, 123, 124, 125]])

In [76]:
new_arr = np.concatenate([arr1,arr2])
new_arr

array([[ 62,  54,  10,  71,  61],
       [ 74,  61,  80,  30,  16],
       [ 87,  79,  50,  92,   6],
       [ 87,  44,  21,  86,  92],
       [ 88,  29,  48,  21,  48],
       [101, 102, 103, 104, 105],
       [106, 107, 108, 109, 110],
       [111, 112, 113, 114, 115],
       [116, 117, 118, 119, 120],
       [121, 122, 123, 124, 125]])

In [77]:
new_arr = np.concatenate([arr1,arr2],axis=1)
new_arr

array([[ 62,  54,  10,  71,  61, 101, 102, 103, 104, 105],
       [ 74,  61,  80,  30,  16, 106, 107, 108, 109, 110],
       [ 87,  79,  50,  92,   6, 111, 112, 113, 114, 115],
       [ 87,  44,  21,  86,  92, 116, 117, 118, 119, 120],
       [ 88,  29,  48,  21,  48, 121, 122, 123, 124, 125]])

# Splitting Arrays

In [78]:
new_arr

array([[ 62,  54,  10,  71,  61, 101, 102, 103, 104, 105],
       [ 74,  61,  80,  30,  16, 106, 107, 108, 109, 110],
       [ 87,  79,  50,  92,   6, 111, 112, 113, 114, 115],
       [ 87,  44,  21,  86,  92, 116, 117, 118, 119, 120],
       [ 88,  29,  48,  21,  48, 121, 122, 123, 124, 125]])

In [79]:
np.split(new_arr,5,axis=1)

[array([[62, 54],
        [74, 61],
        [87, 79],
        [87, 44],
        [88, 29]]),
 array([[10, 71],
        [80, 30],
        [50, 92],
        [21, 86],
        [48, 21]]),
 array([[ 61, 101],
        [ 16, 106],
        [  6, 111],
        [ 92, 116],
        [ 48, 121]]),
 array([[102, 103],
        [107, 108],
        [112, 113],
        [117, 118],
        [122, 123]]),
 array([[104, 105],
        [109, 110],
        [114, 115],
        [119, 120],
        [124, 125]])]

In [80]:
np.split(new_arr,5,axis=0)

[array([[ 62,  54,  10,  71,  61, 101, 102, 103, 104, 105]]),
 array([[ 74,  61,  80,  30,  16, 106, 107, 108, 109, 110]]),
 array([[ 87,  79,  50,  92,   6, 111, 112, 113, 114, 115]]),
 array([[ 87,  44,  21,  86,  92, 116, 117, 118, 119, 120]]),
 array([[ 88,  29,  48,  21,  48, 121, 122, 123, 124, 125]])]

# 3-Dimensional Array

In [81]:
arr3d = np.random.randint(1,20,(2,4,4)) # depth, rows, columns
arr3d

array([[[15, 17,  1,  5],
        [ 7,  4,  9,  7],
        [18,  9, 12,  8],
        [ 7, 18,  3, 11]],

       [[12, 14, 13, 14],
        [18, 18, 17,  6],
        [ 7,  4,  6, 11],
        [15,  4,  3,  7]]])

In [82]:
arr3d = np.arange(40).reshape(4,2,5)
arr3d

array([[[ 0,  1,  2,  3,  4],
        [ 5,  6,  7,  8,  9]],

       [[10, 11, 12, 13, 14],
        [15, 16, 17, 18, 19]],

       [[20, 21, 22, 23, 24],
        [25, 26, 27, 28, 29]],

       [[30, 31, 32, 33, 34],
        [35, 36, 37, 38, 39]]])

In [83]:
arr3d = np.arange(25).reshape(1,5,5)
arr3d

array([[[ 0,  1,  2,  3,  4],
        [ 5,  6,  7,  8,  9],
        [10, 11, 12, 13, 14],
        [15, 16, 17, 18, 19],
        [20, 21, 22, 23, 24]]])

In [84]:
arr3d = np.random.randint(1,20,(3,4,4)) # depth, rows, columns
arr3d

array([[[ 9,  6, 19, 10],
        [13, 15, 10, 10],
        [ 8,  6,  9, 18],
        [ 6,  5,  6,  8]],

       [[ 2, 15, 16,  3],
        [16,  2, 18, 16],
        [12,  3,  4,  8],
        [ 4,  8,  2,  6]],

       [[13,  6,  5, 13],
        [13, 16,  6,  1],
        [12,  7, 16,  7],
        [17, 11,  9,  4]]])

In [85]:
arr3d[1,2,1]

3

In [86]:
arr3d[2,1,2]

6

In [87]:
arr3d[2:,1:3, 1:3]

array([[[16,  6],
        [ 7, 16]]])

In [88]:
import pandas as pd

In [89]:
data = pd.read_excel("employee.xlsx")

In [90]:
data

    Serial  Emp_ID Designation  Department   Age    Salary
0        1    1101     Manager    Accounts  50.0  200000.0
1        2    1107     Officer          IT  30.0   80000.0
2        3    1203     Officer          HR  28.0       NaN
3        4    1005     Manager          HR  45.0  120000.0
4        5    2123  Office Boy    Accounts  27.0   45000.0
5        6    2451  Accountant         NaN  34.0  100000.0
6        7    1111  Accountant    Accounts   NaN  110000.0
7        8    1001     Officer          IT  25.0   75000.0
8        9    1234     Manager          IT  23.0       NaN
9       10    2156    Engineer  Production  45.0   89000.0
10      11    6543     Officer  Production  29.0  100000.0
11      12    3214  Accountant     Account  49.0  123000.0
12      13    2156    Engineer  Production  45.0   89000.0
13      14    1098     Officer          IT  25.0  100000.0
14      15    2912     Officer          IT  31.0   90000.0
15      16    1222     Officer         NaN  25.0       NaN
16      17    2156    Engineer  Production  45.0   89000.0
17      18    2123  Office Boy    Accounts  27.0   45000.0

# Class3(1stJne2024)

# Pandas for data Analysis

 - Python Library
 - It deals every type of data

## Pandas Data Structures

     - Pandas Series Object
     - Pandas DataFrame Object

# Series

In [91]:
import pandas as pd

In [92]:
#Creating a series
s1 = pd.Series(['Nasir', 'Asad', 'Fahad', 'Saba', "Ali"])
s1

0    Nasir
1     Asad
2    Fahad
3     Saba
4      Ali
dtype: object

In [93]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [94]:
s1.values

array(['Nasir', 'Asad', 'Fahad', 'Saba', 'Ali'], dtype=object)

In [95]:
s1.dtype

dtype('O')

In [96]:
s1[3]

'Saba'

In [97]:
s1[1:4]

1     Asad
2    Fahad
3     Saba
dtype: object

### Label Index
   - Customized labels (integers , string )

In [98]:
s2  = pd.Series([6,12,6,12,2,36,12,24,6,12],
index=['Oranges', 'Apples', 'Peeches', 'Kiwis', 'Bananas', 'Cherries', 'Mangoes', 'Apricot', 'Melon', 'Papaya'])

In [1]:
s2

NameError: name 's2' is not defined

In [100]:
s2['Kiwis']

12

In [101]:
s2['Melon']

6

In [102]:
s2['Apples':"Apricot"]

Apples      12
Peeches      6
Kiwis       12
Bananas      2
Cherries    36
Mangoes     12
Apricot     24
dtype: int64

In [103]:
s2[s2==12]

Apples     12
Kiwis      12
Mangoes    12
Papaya     12
dtype: int64

In [104]:
s3 = pd.Series({'a':12,'b':2, 'c':20, 'd':6})
s3

a    12
b     2
c    20
d     6
dtype: int64

# DataFrame

In [2]:
df = pd.DataFrame({'roll':[11,22,33,44,55,66,77,88,99],
              'student name':['Nasir', 'Asad', 'Fahad', 'Saba', 'Ali','Faisal', 'Rehan','Yasir', 'Anum'],
              'course':['Python', 'Web', 'Python', 'Web', 'C#', 'SQL','C#', 'Web', 'SQL'],
              'Marks':[90,89,87,67,76,78,90,98,99]},index=['A','B','C','D',"E","F","G","H","I"])

NameError: name 'pd' is not defined

In [3]:
data = df.copy()

NameError: name 'df' is not defined

In [107]:
data.shape

(9, 4)

In [108]:
data.columns

Index(['roll', 'student name', 'course', 'Marks'], dtype='object')

In [109]:
data.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'], dtype='object')

In [110]:
data.set_index('roll',inplace=True)

In [111]:
data

     student name  course  Marks
roll
11          Nasir  Python     90
22           Asad     Web     89
33          Fahad  Python     87
44           Saba     Web     67
55            Ali      C#     76
66         Faisal     SQL     78
77          Rehan      C#     90
88          Yasir     Web     98
99           Anum     SQL     99

In [112]:
# Selecting a single column from data frame

marks = data['Marks']
marks

roll
11    90
22    89
33    87
44    67
55    76
66    78
77    90
88    98
99    99
Name: Marks, dtype: int64

In [113]:
type(marks)

pandas.core.series.Series

In [114]:
marks = data.Marks
marks

roll
11    90
22    89
33    87
44    67
55    76
66    78
77    90
88    98
99    99
Name: Marks, dtype: int64

In [115]:
data['student name']

roll
11     Nasir
22      Asad
33     Fahad
44      Saba
55       Ali
66    Faisal
77     Rehan
88     Yasir
99      Anum
Name: student name, dtype: object

In [116]:
# changing columns names (1st way)
print("Original Col name:")
print(data.columns)

data.columns = ['studentname', 'course', 'Marks']
print("Modified Col Names")
data.columns

Original Col name:
Index(['student name', 'course', 'Marks'], dtype='object')
Modified Col Names

Index(['studentname', 'course', 'Marks'], dtype='object')

In [117]:
# changing columns names (2nd way)

data.rename(columns={'Marks':'marks'},inplace=True)

In [118]:
data

     studentname  course  marks
roll
11         Nasir  Python     90
22          Asad     Web     89
33         Fahad  Python     87
44          Saba     Web     67
55           Ali      C#     76
66        Faisal     SQL     78
77         Rehan      C#     90
88         Yasir     Web     98
99          Anum     SQL     99

In [119]:
#Selecting more than one column from data frame 
data['marks','course']

KeyError: ('marks', 'course')

In [ ]:
data[['marks','course']]

In [ ]:
#Adding nrwe column in existing data frame

data['result'] = [ 'Pass' if d>=70 else 'Fail' for d in data.marks]

#generating data from data

In [4]:
data

NameError: name 'data' is not defined

In [ ]:
data['total'] =100

In [ ]:
data

In [ ]:
data['Extra'] = 'Extra'

In [ ]:
data

In [ ]:
data.drop('Extra', inplace=True,axis=1)

In [ ]:
data

In [ ]:
def assign_grade(marks):
    if marks>=90:
        return "A+"
    elif marks>=80:
        return "A"
    elif marks>=70:
        return "B"
    elif marks>=60:
        return "C"
    elif marks>=50:
        return "D"
    else: 
        return "F"

In [120]:
data.marks.apply(assign_grade)

NameError: name 'assign_grade' is not defined

In [121]:
data['grade'] = data.marks.apply(lambda x: 'A+' if x>=90 else 'A' if x>=80 else "B" if x>=70 else 'C' if x>=60 else 'D' if x>=50 else 'F')

In [122]:
data

     studentname  course  marks grade
roll
11         Nasir  Python     90    A+
22          Asad     Web     89     A
33         Fahad  Python     87     A
44          Saba     Web     67     C
55           Ali      C#     76     B
66        Faisal     SQL     78     B
77         Rehan      C#     90    A+
88         Yasir     Web     98    A+
99          Anum     SQL     99    A+

In [123]:
data = data[['studentname', 'course', 'marks', 'grade', 'result', 'total']]

KeyError: "['result', 'total'] not in index"

In [124]:
# changing the title of index columns

data.index.name = 'title'

In [125]:
data

      studentname  course  marks grade
title
11          Nasir  Python     90    A+
22           Asad     Web     89     A
33          Fahad  Python     87     A
44           Saba     Web     67     C
55            Ali      C#     76     B
66         Faisal     SQL     78     B
77          Rehan      C#     90    A+
88          Yasir     Web     98    A+
99           Anum     SQL     99    A+

# Class4(2June2024)

In [126]:
# accessing rows
data[11]

KeyError: 11

In [127]:
data[22:44, ['course', 'marks']]

InvalidIndexError: (slice(22, 44, None), ['course', 'marks'])

# loc and iloc

In [128]:
data.loc[22:44, ['course', 'marks']]

       course  marks
title
22        Web     89
33     Python     87
44        Web     67

In [129]:
data.iloc[2:5, 1:3]

       course  marks
title
33     Python     87
44        Web     67
55         C#     76

In [130]:
df = pd.read_excel("employee.xlsx")
df

    Serial  Emp_ID Designation  Department   Age    Salary
0        1    1101     Manager    Accounts  50.0  200000.0
1        2    1107     Officer          IT  30.0   80000.0
2        3    1203     Officer          HR  28.0       NaN
3        4    1005     Manager          HR  45.0  120000.0
4        5    2123  Office Boy    Accounts  27.0   45000.0
5        6    2451  Accountant         NaN  34.0  100000.0
6        7    1111  Accountant    Accounts   NaN  110000.0
7        8    1001     Officer          IT  25.0   75000.0
8        9    1234     Manager          IT  23.0       NaN
9       10    2156    Engineer  Production  45.0   89000.0
10      11    6543     Officer  Production  29.0  100000.0
11      12    3214  Accountant     Account  49.0  123000.0
12      13    2156    Engineer  Production  45.0   89000.0
13      14    1098     Officer          IT  25.0  100000.0
14      15    2912     Officer          IT  31.0   90000.0
15      16    1222     Officer         NaN  25.0       NaN
16      17    2156    Engineer  Production  45.0   89000.0
17      18    2123  Office Boy    Accounts  27.0   45000.0

In [131]:
df = pd.read_excel("employee.xlsx",usecols=['Emp_ID','Salary'])
df

    Emp_ID    Salary
0     1101  200000.0
1     1107   80000.0
2     1203       NaN
3     1005  120000.0
4     2123   45000.0
5     2451  100000.0
6     1111  110000.0
7     1001   75000.0
8     1234       NaN
9     2156   89000.0
10    6543  100000.0
11    3214  123000.0
12    2156   89000.0
13    1098  100000.0
14    2912   90000.0
15    1222       NaN
16    2156   89000.0
17    2123   45000.0

In [132]:
df = pd.read_excel("employee.xlsx",index_col='Serial')
df

        Emp_ID Designation  Department   Age    Salary
Serial
1         1101     Manager    Accounts  50.0  200000.0
2         1107     Officer          IT  30.0   80000.0
3         1203     Officer          HR  28.0       NaN
4         1005     Manager          HR  45.0  120000.0
5         2123  Office Boy    Accounts  27.0   45000.0
6         2451  Accountant         NaN  34.0  100000.0
7         1111  Accountant    Accounts   NaN  110000.0
8         1001     Officer          IT  25.0   75000.0
9         1234     Manager          IT  23.0       NaN
10        2156    Engineer  Production  45.0   89000.0
11        6543     Officer  Production  29.0  100000.0
12        3214  Accountant     Account  49.0  123000.0
13        2156    Engineer  Production  45.0   89000.0
14        1098     Officer          IT  25.0  100000.0
15        2912     Officer          IT  31.0   90000.0
16        1222     Officer         NaN  25.0       NaN
17        2156    Engineer  Production  45.0   89000.0
18        2123  Office Boy    Accounts  27.0   45000.0

#### Working on Rows

In [133]:
df.loc[10, "Designation":"Age"]

Designation      Engineer
Department     Production
Age                  45.0
Name: 10, dtype: object

In [134]:
df.iloc[9,"Designation":"Age"]

TypeError: cannot do positional indexing on Index with these indexers [Designation] of type str

In [ ]:
df.iloc[9,1:4]

# Filters / Queries / Masks

In [135]:
df

        Emp_ID Designation  Department   Age    Salary
Serial
1         1101     Manager    Accounts  50.0  200000.0
2         1107     Officer          IT  30.0   80000.0
3         1203     Officer          HR  28.0       NaN
4         1005     Manager          HR  45.0  120000.0
5         2123  Office Boy    Accounts  27.0   45000.0
6         2451  Accountant         NaN  34.0  100000.0
7         1111  Accountant    Accounts   NaN  110000.0
8         1001     Officer          IT  25.0   75000.0
9         1234     Manager          IT  23.0       NaN
10        2156    Engineer  Production  45.0   89000.0
11        6543     Officer  Production  29.0  100000.0
12        3214  Accountant     Account  49.0  123000.0
13        2156    Engineer  Production  45.0   89000.0
14        1098     Officer          IT  25.0  100000.0
15        2912     Officer          IT  31.0   90000.0
16        1222     Officer         NaN  25.0       NaN
17        2156    Engineer  Production  45.0   89000.0
18        2123  Office Boy    Accounts  27.0   45000.0

In [136]:
df.Designation=='Manager'

Serial
1      True
2     False
3     False
4      True
5     False
6     False
7     False
8     False
9      True
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
Name: Designation, dtype: bool

In [137]:
df[df.Designation=='Manager']

        Emp_ID Designation Department   Age    Salary
Serial
1         1101     Manager   Accounts  50.0  200000.0
4         1005     Manager         HR  45.0  120000.0
9         1234     Manager         IT  23.0       NaN

In [138]:
df[df.Department=='IT']

        Emp_ID Designation Department   Age    Salary
Serial
2         1107     Officer         IT  30.0   80000.0
8         1001     Officer         IT  25.0   75000.0
9         1234     Manager         IT  23.0       NaN
14        1098     Officer         IT  25.0  100000.0
15        2912     Officer         IT  31.0   90000.0

In [139]:
df[df.Salary>=100000]

        Emp_ID Designation  Department   Age    Salary
Serial
1         1101     Manager    Accounts  50.0  200000.0
4         1005     Manager          HR  45.0  120000.0
6         2451  Accountant         NaN  34.0  100000.0
7         1111  Accountant    Accounts   NaN  110000.0
11        6543     Officer  Production  29.0  100000.0
12        3214  Accountant     Account  49.0  123000.0
14        1098     Officer          IT  25.0  100000.0

In [140]:
df[(df.Salary>=100000) & (df.Age<=40) ]

        Emp_ID Designation  Department   Age    Salary
Serial
6         2451  Accountant         NaN  34.0  100000.0
11        6543     Officer  Production  29.0  100000.0
14        1098     Officer          IT  25.0  100000.0

In [141]:
df.Salary.max()

200000.0

In [142]:
df[df.Salary==df.Salary.max()]

        Emp_ID Designation Department   Age    Salary
Serial
1         1101     Manager   Accounts  50.0  200000.0

In [143]:
df[df.Department=='IT']['Salary'].max()

100000.0

In [144]:
df[(df.Department=="IT") & (df.Salary==df[df.Department=='IT']['Salary'].max())]

        Emp_ID Designation Department   Age    Salary
Serial
14        1098     Officer         IT  25.0  100000.0

In [145]:
df[(df.Department=='IT') &( df.Salary==df[df.Department=='IT']['Salary'].min())]

        Emp_ID Designation Department   Age   Salary
Serial
8         1001     Officer         IT  25.0  75000.0

In [146]:
df.Designation.unique()

array(['Manager', 'Officer', 'Office Boy', 'Accountant', 'Engineer'],
      dtype=object)

In [147]:
df.Designation.value_counts(ascending=True)

Designation
Office Boy    2
Manager       3
Accountant    3
Engineer      3
Officer       7
Name: count, dtype: int64

In [148]:
import pandas as pd
data = pd.read_excel("Sales.xlsx",index_col='S.No.')

FileNotFoundError: [Errno 2] No such file or directory: 'Sales.xlsx'

In [ ]:
data.shape

In [ ]:
data.head(10)

In [ ]:
data.tail()

In [149]:
data.sample(12)

ValueError: Cannot take a larger sample than population when 'replace=False'

In [ ]:
data.info()

In [ ]:
data.describe()

# Data Cleaning
      - Handling Missing Values
      - Handling Duplicate Records

#### Handling Missing Values

In [ ]:
# how many missing values are there in each of the column
data.isna().sum()

In [ ]:
data.isnull().sum()

In [150]:
data.notnull().sum()

studentname    9
course         9
marks          9
grade          9
dtype: int64

In [151]:
data.dropna()

      studentname  course  marks grade
title
11          Nasir  Python     90    A+
22           Asad     Web     89     A
33          Fahad  Python     87     A
44           Saba     Web     67     C
55            Ali      C#     76     B
66         Faisal     SQL     78     B
77          Rehan      C#     90    A+
88          Yasir     Web     98    A+
99           Anum     SQL     99    A+

In [152]:
data.dropna(axis=1)

      studentname  course  marks grade
title
11          Nasir  Python     90    A+
22           Asad     Web     89     A
33          Fahad  Python     87     A
44           Saba     Web     67     C
55            Ali      C#     76     B
66         Faisal     SQL     78     B
77          Rehan      C#     90    A+
88          Yasir     Web     98    A+
99           Anum     SQL     99    A+

In [153]:
data

      studentname  course  marks grade
title
11          Nasir  Python     90    A+
22           Asad     Web     89     A
33          Fahad  Python     87     A
44           Saba     Web     67     C
55            Ali      C#     76     B
66         Faisal     SQL     78     B
77          Rehan      C#     90    A+
88          Yasir     Web     98    A+
99           Anum     SQL     99    A+

In [154]:
import numpy as np
data['NaN'] = np.nan

In [155]:
data.drop('OrderDate',axis=1, inplace=True)

KeyError: "['OrderDate'] not found in axis"

In [156]:
data

      studentname  course  marks grade  NaN
title
11          Nasir  Python     90    A+  NaN
22           Asad     Web     89     A  NaN
33          Fahad  Python     87     A  NaN
44           Saba     Web     67     C  NaN
55            Ali      C#     76     B  NaN
66         Faisal     SQL     78     B  NaN
77          Rehan      C#     90    A+  NaN
88          Yasir     Web     98    A+  NaN
99           Anum     SQL     99    A+  NaN

In [157]:
record = pd.DataFrame({'Region':'East', 'Manager':np.nan, 'SalesMan':'Steven', 'Item':"Television",
                      'Units':50, 'Unit_price':20, "Sale_amt":1000, 'NaN':np.nan},index=[53])

In [158]:
record2 = pd.DataFrame({'Region':np.nan, 'Manager':np.nan, 'SalesMan':np.nan, 'Item':np.nan,
                      'Units':np.nan, 'Unit_price':np.nan, "Sale_amt":np.nan, 'NaN':np.nan},index=[54])

In [159]:
record

   Region  Manager SalesMan        Item  Units  Unit_price  Sale_amt  NaN
53   East      NaN   Steven  Television     50          20      1000  NaN

In [160]:
data = pd.concat([data,record,record2])

In [161]:
data

,studentname,course,marks,grade,NaN,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
11,Nasir,Python,90.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,Asad,Web,89.0,A,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
33,Fahad,Python,87.0,A,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
44,Saba,Web,67.0,C,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
55,Ali,C#,76.0,B,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
66,Faisal,SQL,78.0,B,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
77,Rehan,C#,90.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88,Yasir,Web,98.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
99,Anum,SQL,99.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
53,NaN,NaN,NaN,NaN,NaN,East,NaN,Steven,Television,50.0,20.0,1000.0
54,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [162]:
data.dropna(axis=0,how='all')

,studentname,course,marks,grade,NaN,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
11,Nasir,Python,90.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,Asad,Web,89.0,A,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
33,Fahad,Python,87.0,A,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
44,Saba,Web,67.0,C,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
55,Ali,C#,76.0,B,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
66,Faisal,SQL,78.0,B,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
77,Rehan,C#,90.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88,Yasir,Web,98.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
99,Anum,SQL,99.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
53,NaN,NaN,NaN,NaN,NaN,East,NaN,Steven,Television,50.0,20.0,1000.0

In [163]:
data.dropna(axis=0, how='all')

,studentname,course,marks,grade,NaN,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
11,Nasir,Python,90.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,Asad,Web,89.0,A,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
33,Fahad,Python,87.0,A,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
44,Saba,Web,67.0,C,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
55,Ali,C#,76.0,B,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
66,Faisal,SQL,78.0,B,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
77,Rehan,C#,90.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88,Yasir,Web,98.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
99,Anum,SQL,99.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
53,NaN,NaN,NaN,NaN,NaN,East,NaN,Steven,Television,50.0,20.0,1000.0

In [164]:
data.dropna(axis=1, thresh=50)

Empty DataFrame
Columns: []
Index: [11, 22, 33, 44, 55, 66, 77, 88, 99, 53, 54]

In [165]:
data.isna().sum()

studentname     2
course          2
marks           2
grade           2
NaN            11
Region         10
Manager        11
SalesMan       10
Item           10
Units          10
Unit_price     10
Sale_amt       10
dtype: int64

In [166]:
data.dropna(axis=1, thresh=math.ceil(data.shape[0]*.70))

NameError: name 'math' is not defined

In [167]:
data.shape[0]*.70

7.699999999999999

In [168]:
import math

In [169]:
math.ceil(data.shape[0]*.70) , math.floor(data.shape[0]*.70)

(8, 7)

In [170]:
data.dropna(axis=0, subset=['Manager',"SalesMan", 'Item'])

Empty DataFrame
Columns: [studentname, course, marks, grade, NaN, Region, Manager, SalesMan, Item, Units, Unit_price, Sale_amt]
Index: []

# Filling Missing Values

In [171]:
data.Region.fillna(data.Region.mode()[0])

11    East
22    East
33    East
44    East
55    East
66    East
77    East
88    East
99    East
53    East
54    East
Name: Region, dtype: object

In [172]:
data.Region.mode()

0    East
Name: Region, dtype: object

In [173]:
data.Manager.mode()

Series([], Name: Manager, dtype: float64)

In [174]:
data.SalesMan.mode()

0    Steven
Name: SalesMan, dtype: object

In [175]:
data.Item.mode()

0    Television
Name: Item, dtype: object

In [1]:
data.fillna({'Region':data.Region.mode()[0],
            'Manager':data.Manager.mode()[0],
            "SalesMan":data.SalesMan.mode()[0],
            "Item":data.Item.mode()[0],
             "Units":data.Units.mean(),
             "Unit_price":data.Unit_price.mean(),
             'Sale_amt':data.Sale_amt.mean()
            },axis=0,inplace=True)

NameError: name 'data' is not defined

In [ ]:
data

In [ ]:
data.isna().sum()

In [ ]:
data.fillna()

In [ ]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                  [np.nan, np.nan, np.nan, np.nan],
                 [np.nan, 3, np.nan, 4]],
               columns=list("ABCD"))

In [ ]:
df

In [ ]:
df.fillna(method='ffill')

In [ ]:
df.fillna(method='bfill')

In [ ]:
import pandas as pd
data = pd.read_csv("car_data.csv")

In [177]:
data.shape

(11, 12)

In [178]:
data.head()

,studentname,course,marks,grade,NaN,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
11,Nasir,Python,90.0,A+,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,Asad,Web,89.0,A,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
33,Fahad,Python,87.0,A,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
44,Saba,Web,67.0,C,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
55,Ali,C#,76.0,B,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [179]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, 11 to 54
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   studentname  9 non-null      object
 1   course       9 non-null      object
 2   marks        9 non-null      float64
 3   grade        9 non-null      object
 4   NaN          0 non-null      float64
 5   Region       1 non-null      object
 6   Manager      0 non-null      float64
 7   SalesMan     1 non-null      object
 8   Item         1 non-null      object
 9   Units        1 non-null      float64
 10  Unit_price   1 non-null      float64
 11  Sale_amt     1 non-null      float64
dtypes: float64(6), object(6)
memory usage: 1.1+ KB

In [180]:
data.name

AttributeError: 'DataFrame' object has no attribute 'name'

In [181]:
data.name.unique()

AttributeError: 'DataFrame' object has no attribute 'name'

In [182]:
data.duplicated().sum()

0

In [183]:
data.company

AttributeError: 'DataFrame' object has no attribute 'company'

In [184]:
data.company.unique()

AttributeError: 'DataFrame' object has no attribute 'company'

In [185]:
data.year.unique()

AttributeError: 'DataFrame' object has no attribute 'year'

In [186]:
data.kms_driven.unique()

AttributeError: 'DataFrame' object has no attribute 'kms_driven'

In [187]:
data.Price.unique()

AttributeError: 'DataFrame' object has no attribute 'Price'

In [188]:
data.fuel_type.unique()

AttributeError: 'DataFrame' object has no attribute 'fuel_type'

# Duplicates

In [189]:
data.duplicated().sum()

0

In [190]:
duplicate_records = data[data.duplicated()]

In [191]:
# removing duplicates using filter 
unique_records = data[~data.duplicated()]
unique_records.shape

(11, 12)

In [192]:
# dropping duplicates
data.drop_duplicates(inplace=True)

In [193]:
data.shape

(11, 12)

# Cleaning ->Name

In [194]:
data.name = data.name.str.split(" ").str[:3].str.join(" ")

AttributeError: 'DataFrame' object has no attribute 'name'

In [1]:
data.company.unique()

NameError: name 'data' is not defined

In [196]:
data.company.value_counts()

AttributeError: 'DataFrame' object has no attribute 'company'

In [197]:
data = data[~((data.company=="7") | (data.company=="9") | (data.company=='2012'))]

AttributeError: 'DataFrame' object has no attribute 'company'

In [2]:
data.company.unique()

NameError: name 'data' is not defined

In [3]:
data.company = data.company.apply(lambda x: x.lower())

NameError: name 'data' is not defined

In [200]:
data.company.unique()

AttributeError: 'DataFrame' object has no attribute 'company'

In [201]:
data.year.unique()

AttributeError: 'DataFrame' object has no attribute 'year'

In [4]:
data = data[data.year.str.isnumeric()]

NameError: name 'data' is not defined

In [203]:
data.year.unique()

AttributeError: 'DataFrame' object has no attribute 'year'

In [204]:
data.year = data.year.astype('int')

AttributeError: 'DataFrame' object has no attribute 'year'

In [205]:
data.rename(columns={'Price':'price'}, inplace=True)

In [206]:
data.price.unique()

AttributeError: 'DataFrame' object has no attribute 'price'

In [9]:
data[data.price=="Ask For Price"].shape

NameError: name 'data' is not defined

In [6]:
data = data[~(data.price=="Ask For Price")]

NameError: name 'data' is not defined

In [209]:
data.price.unique()

AttributeError: 'DataFrame' object has no attribute 'price'

In [210]:
data.price.str.split(",").str.join("").astype('float')

AttributeError: 'DataFrame' object has no attribute 'price'

In [7]:
data.price  = data.price.str.replace(",", "").astype("float")

NameError: name 'data' is not defined

In [212]:
data.kms_driven.unique()

AttributeError: 'DataFrame' object has no attribute 'kms_driven'

In [8]:
data = data[~(data.kms_driven=='Petrol')]

NameError: name 'data' is not defined

In [214]:
data.kms_driven = data.kms_driven.str.replace(",", "").str.replace("kms","").astype("float")

AttributeError: 'DataFrame' object has no attribute 'kms_driven'

In [10]:
data.fuel_type.unique()

NameError: name 'data' is not defined

In [216]:
data.dropna(inplace=True)

In [217]:
data.reset_index(inplace=True)

In [218]:
data

Empty DataFrame
Columns: [index, studentname, course, marks, grade, NaN, Region, Manager, SalesMan, Item, Units, Unit_price, Sale_amt]
Index: []

In [219]:
data.to_csv("cleaned_data.csv")

# Class5(15June2024)

# Data Transformation

# Mapping

In [220]:
import pandas as pd

data = {
    'Country Name': ['USA', 'Canada', 'Mexico', 'USA', 'Canada', 'Mexico'],
    'Population': [331449281, 38005238, 130262216, 331449281, 38005238, 130262216],
    'Area': [9833520, 9984670, 1964375, 9833520, 9984670, 1964375],
    'Presidents': ['Joe Biden', 'Justin Trudeau', 'Andrés Manuel López Obrador',
                   'Joe Biden', 'Justin Trudeau', 'Andrés Manuel López Obrador']
}

df = pd.DataFrame(data)
df

  Country Name  Population     Area                   Presidents
0          USA   331449281  9833520                    Joe Biden
1       Canada    38005238  9984670               Justin Trudeau
2       Mexico   130262216  1964375  Andrés Manuel López Obrador
3          USA   331449281  9833520                    Joe Biden
4       Canada    38005238  9984670               Justin Trudeau
5       Mexico   130262216  1964375  Andrés Manuel López Obrador

In [221]:
country_capital = {'USA':"Washington, D.C.","Canada":"Otawa", "Mexico":"Mexico City"}

In [222]:
df['Capitals'] =df['Country Name'].map(country_capital)

In [223]:
df

,Country Name,Population,Area,Presidents,Capitals
0,USA,331449281,9833520,Joe Biden,"Washington, D.C."
1,Canada,38005238,9984670,Justin Trudeau,Otawa
2,Mexico,130262216,1964375,Andrés Manuel López Obrador,Mexico City
3,USA,331449281,9833520,Joe Biden,"Washington, D.C."
4,Canada,38005238,9984670,Justin Trudeau,Otawa
5,Mexico,130262216,1964375,Andrés Manuel López Obrador,Mexico City

In [224]:
import pandas as pd

# Example data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45],
    'Department': ['HR', 'Engineering', 'Finance', 'HR', 'Engineering']
}

# Create a dataframe
df = pd.DataFrame(data)
df

      Name  Age   Department
0    Alice   25           HR
1      Bob   30  Engineering
2  Charlie   35      Finance
3    David   40           HR
4      Eve   45  Engineering

In [225]:

# Mapping dictionary for department heads
department_heads = {
    'HR': 'Susan',
    'Engineering': 'Michael',
    'Finance': 'Emily'
}

In [226]:
# Add a new column 'Department_Head' by mapping 'Department' column using department_heads dictionary
df['Department_Head'] = df['Department'].map(department_heads)

df

      Name  Age   Department Department_Head
0    Alice   25           HR           Susan
1      Bob   30  Engineering         Michael
2  Charlie   35      Finance           Emily
3    David   40           HR           Susan
4      Eve   45  Engineering         Michael

# Discretization and Binning
  -Continuous data is often discretized or otherwise separated into “bins” for analysis

In [227]:
data = pd.read_excel("binning.xlsx")

In [228]:
data

      Name  Qualification  Age
0      Asad            BS   23
1     Samad            MS   30
2     Ahmed            BS   45
3     Salim           Phd   56
4    Fasial            MS   29
5      Anam      Graduate   30
6     Saima            MS   34
7     Salma            BS   46
8    Salman            MS   56
9   Hussain            MS   67
10      Ali            BS   66
11    Hamza            BS   61
12   Kashif            BS   70

In [229]:
bins = [20, 30, 40, 50, 60,70,80]

In [230]:
cats = pd.cut(data.Age, bins)
data['AgeCats'] = cats

data

      Name  Qualification  Age   AgeCats
0      Asad            BS   23  (20, 30]
1     Samad            MS   30  (20, 30]
2     Ahmed            BS   45  (40, 50]
3     Salim           Phd   56  (50, 60]
4    Fasial            MS   29  (20, 30]
5      Anam      Graduate   30  (20, 30]
6     Saima            MS   34  (30, 40]
7     Salma            BS   46  (40, 50]
8    Salman            MS   56  (50, 60]
9   Hussain            MS   67  (60, 70]
10      Ali            BS   66  (60, 70]
11    Hamza            BS   61  (60, 70]
12   Kashif            BS   70  (60, 70]

In [231]:
pd.value_counts(data.AgeCats)

AgeCats
(20, 30]    4
(60, 70]    4
(40, 50]    2
(50, 60]    2
(30, 40]    1
(70, 80]    0
Name: count, dtype: int64

In [232]:
data.Age.apply(lambda x: "Very Young" if  x<=20 
                         else "Young"          if x<=30 
                         else "Grownup"        if  x<=40 
                         else "Mature Human"   if x<=50 
                         else "Old"            if x<=60 
                         else "Very Old"       if x<=70 
                         else x)

0            Young
1            Young
2     Mature Human
3              Old
4            Young
5            Young
6          Grownup
7     Mature Human
8              Old
9         Very Old
10        Very Old
11        Very Old
12        Very Old
Name: Age, dtype: object

# Class6(22June2024)

### Data Wrangling
          - combinig and merging data from different sources.

#### Concatenating Data

In [233]:
import pandas as pd
df0 = pd.read_excel('test_data.xlsx',sheet_name=0)
df1 = pd.read_excel('test_data.xlsx',sheet_name=1)
df2 = pd.read_excel('test_data.xlsx',sheet_name=2)

In [234]:
df0

   sales_man_id sales_man_name sales_man_city  product_id manager
0             1           Asad        Karachi         123   Jawed
1             2         Sumair         Lahore         123   Jawed
2             3         Farjad        Karachi         145   Najam
3             4         Hassan         Lahore         567   Najam
4             5          Nasir      Hyderabad         234   Jawed
5             6         Kashif      Hyderabad         234  Faisal
6             7           Sana         Lahore         567  Faisal
7             8         Fatima        Karachi         345   Najam
8             9       Abdullah        Karachi         123  Faisal

In [235]:
df0.shape

(9, 5)

In [236]:
df1

    sales_man_id sales_man_name sales_man_city  product_id manager  Experience
0              1          Ahmed        Karachi         123   Jawed           2
1             22           Umer         Lahore         123   Jawed           3
2             33        Huzaifa        Karachi         145   Najam           4
3              4           Asad         Lahore         567   Najam           5
4             55        Hussain      Hyderabad         234   Jawed           6
5             66            Ali      Hyderabad         234  Faisal           7
6             77          Sadaf         Lahore         567  Faisal           8
7             88          Kiran        Karachi         345   Najam           9
8             99            Ali        Karachi         123  Faisal           1
9            101           Asad      Hyderabad         432   Jawed           4
10           101           Asad      Hyderabad         432   Jawed           5

In [237]:
df1.shape

(11, 6)

In [238]:
#Concate on axis=0
pd.concat([df1,df0])

    sales_man_id sales_man_name sales_man_city  product_id manager  Experience
0              1          Ahmed        Karachi         123   Jawed         2.0
1             22           Umer         Lahore         123   Jawed         3.0
2             33        Huzaifa        Karachi         145   Najam         4.0
3              4           Asad         Lahore         567   Najam         5.0
4             55        Hussain      Hyderabad         234   Jawed         6.0
5             66            Ali      Hyderabad         234  Faisal         7.0
6             77          Sadaf         Lahore         567  Faisal         8.0
7             88          Kiran        Karachi         345   Najam         9.0
8             99            Ali        Karachi         123  Faisal         1.0
9            101           Asad      Hyderabad         432   Jawed         4.0
10           101           Asad      Hyderabad         432   Jawed         5.0
0              1           Asad        Karachi         123   Jawed         NaN
1              2         Sumair         Lahore         123   Jawed         NaN
2              3         Farjad        Karachi         145   Najam         NaN
3              4         Hassan         Lahore         567   Najam         NaN
4              5          Nasir      Hyderabad         234   Jawed         NaN
5              6         Kashif      Hyderabad         234  Faisal         NaN
6              7           Sana         Lahore         567  Faisal         NaN
7              8         Fatima        Karachi         345   Najam         NaN
8              9       Abdullah        Karachi         123  Faisal         NaN

In [239]:
#Concate on axis=1
pd.concat([df1,df0],axis=1)

,sales_man_id,sales_man_name,sales_man_city,product_id,manager,Experience,sales_man_id,sales_man_name,sales_man_city,product_id,manager
0,1,Ahmed,Karachi,123,Jawed,2,1.0,Asad,Karachi,123.0,Jawed
1,22,Umer,Lahore,123,Jawed,3,2.0,Sumair,Lahore,123.0,Jawed
2,33,Huzaifa,Karachi,145,Najam,4,3.0,Farjad,Karachi,145.0,Najam
3,4,Asad,Lahore,567,Najam,5,4.0,Hassan,Lahore,567.0,Najam
4,55,Hussain,Hyderabad,234,Jawed,6,5.0,Nasir,Hyderabad,234.0,Jawed
5,66,Ali,Hyderabad,234,Faisal,7,6.0,Kashif,Hyderabad,234.0,Faisal
6,77,Sadaf,Lahore,567,Faisal,8,7.0,Sana,Lahore,567.0,Faisal
7,88,Kiran,Karachi,345,Najam,9,8.0,Fatima,Karachi,345.0,Najam
8,99,Ali,Karachi,123,Faisal,1,9.0,Abdullah,Karachi,123.0,Faisal
9,101,Asad,Hyderabad,432,Jawed,4,NaN,NaN,NaN,NaN,NaN
10,101,Asad,Hyderabad,432,Jawed,5,NaN,NaN,NaN,NaN,NaN

In [240]:
import pandas as pd
import numpy as np

# Define the number of records
num_records = 50

# Generate random data for the DataFrame
np.random.seed(0)

# Generate data for each column
emp_ids = range(1, num_records + 1)
emp_names = ['Employee ' + str(i) for i in emp_ids]
departments = ['HR', 'IT', 'Finance', 'Marketing', 'Operations']
emp_departments = np.random.choice(departments, num_records)
emp_salaries = np.random.randint(30000, 90000, size=num_records)
emp_ages = np.random.randint(22, 60, size=num_records)
emp_genders = np.random.choice(['Male', 'Female'], size=num_records)
emp_service_years = np.random.randint(1, 20, size=num_records)
designations = ['Manager', 'Assistant Manager', 'Senior Analyst', 'Developer', 'Sales Executive']
emp_designations = np.random.choice(designations, num_records)
employment_status = np.random.choice(['Full-Time', 'Part-Time', 'Contract'], size=num_records)

# Create the DataFrame
employee_data = pd.DataFrame({
    'emp_id': emp_ids,
    'emp_name': emp_names,
    'emp_department': emp_departments,
    'emp_salary': emp_salaries,
    'emp_age': emp_ages,
    'emp_gender': emp_genders,
    'emp_service_years': emp_service_years,
    'emp_designation': emp_designations,
    'employment_status': employment_status
})

# Display the first few records to verify
employee_data.head()

,emp_id,emp_name,emp_department,emp_salary,emp_age,emp_gender,emp_service_years,emp_designation,employment_status
0,1,Employee 1,Operations,80793,58,Female,13,Manager,Full-Time
1,2,Employee 2,HR,76522,56,Female,4,Assistant Manager,Full-Time
2,3,Employee 3,Marketing,77647,51,Female,19,Assistant Manager,Full-Time
3,4,Employee 4,Marketing,51368,25,Male,16,Manager,Part-Time
4,5,Employee 5,Marketing,50737,56,Male,4,Developer,Contract

In [241]:
employee_data[employee_data['emp_department']=='Marketing']

,emp_id,emp_name,emp_department,emp_salary,emp_age,emp_gender,emp_service_years,emp_designation,employment_status
2,3,Employee 3,Marketing,77647,51,Female,19,Assistant Manager,Full-Time
3,4,Employee 4,Marketing,51368,25,Male,16,Manager,Part-Time
4,5,Employee 5,Marketing,50737,56,Male,4,Developer,Contract
6,7,Employee 7,Marketing,56681,43,Female,13,Developer,Full-Time
20,21,Employee 21,Marketing,81403,49,Female,15,Sales Executive,Full-Time
22,23,Employee 23,Marketing,75830,23,Female,4,Sales Executive,Contract
25,26,Employee 26,Marketing,44324,44,Male,10,Developer,Contract
28,29,Employee 29,Marketing,39396,38,Female,15,Senior Analyst,Part-Time
29,30,Employee 30,Marketing,77080,54,Female,19,Sales Executive,Part-Time
30,31,Employee 31,Marketing,33918,22,Male,13,Developer,Full-Time
38,39,Employee 39,Marketing,67237,56,Female,13,Developer,Full-Time
39,40,Employee 40,Marketing,44165,35,Male,3,Assistant Manager,Contract

In [242]:
employee_data.emp_department.unique()

array(['Operations', 'HR', 'Marketing', 'IT', 'Finance'], dtype=object)

In [243]:
import pandas as pd
import numpy as np

# Assuming 'employee_data' DataFrame is already created as per the previous example

# Filter data where department is 'Marketing'
marketing = employee_data[employee_data['emp_department'] == 'Marketing'].copy()

# Add additional column 'campaign_type'
compaign_types = ['Social Media', 'Print Media', 'Electronic Media']
marketing['compaign_type'] = np.random.choice(compaign_types, size=marketing.shape[0])

# Display the marketing DataFrame
marketing.head()
marketing = marketing[['emp_id','emp_name','emp_designation','compaign_type']]

In [244]:
marketing.reset_index(drop=True, inplace=True)

In [245]:
marketing['marketing_exp']= [4,5,6,1,2,3,7,8,9,12,10,3]
marketing

    emp_id     emp_name    emp_designation     compaign_type  marketing_exp
0        3   Employee 3  Assistant Manager  Electronic Media              4
1        4   Employee 4            Manager       Print Media              5
2        5   Employee 5          Developer       Print Media              6
3        7   Employee 7          Developer  Electronic Media              1
4       21  Employee 21    Sales Executive  Electronic Media              2
5       23  Employee 23    Sales Executive       Print Media              3
6       26  Employee 26          Developer      Social Media              7
7       29  Employee 29     Senior Analyst  Electronic Media              8
8       30  Employee 30    Sales Executive      Social Media              9
9       31  Employee 31          Developer  Electronic Media             12
10      39  Employee 39          Developer      Social Media             10
11      40  Employee 40  Assistant Manager  Electronic Media              3

In [246]:
merged_marketing_data = pd.merge(marketing,employee_data,how='inner',on='emp_id')[['emp_id', 'emp_name_x','emp_department',"emp_designation_x",'marketing_exp', 'emp_salary']]
merged_marketing_data

,emp_id,emp_name_x,emp_department,emp_designation_x,marketing_exp,emp_salary
0,3,Employee 3,Marketing,Assistant Manager,4,77647
1,4,Employee 4,Marketing,Manager,5,51368
2,5,Employee 5,Marketing,Developer,6,50737
3,7,Employee 7,Marketing,Developer,1,56681
4,21,Employee 21,Marketing,Sales Executive,2,81403
5,23,Employee 23,Marketing,Sales Executive,3,75830
6,26,Employee 26,Marketing,Developer,7,44324
7,29,Employee 29,Marketing,Senior Analyst,8,39396
8,30,Employee 30,Marketing,Sales Executive,9,77080
9,31,Employee 31,Marketing,Developer,12,33918
10,39,Employee 39,Marketing,Developer,10,67237
11,40,Employee 40,Marketing,Assistant Manager,3,44165

In [247]:
merged_marketing_data[['emp_id', 'emp_name_x','emp_department',"emp_designation_x",'marketing_exp', 'emp_salary']]

,emp_id,emp_name_x,emp_department,emp_designation_x,marketing_exp,emp_salary
0,3,Employee 3,Marketing,Assistant Manager,4,77647
1,4,Employee 4,Marketing,Manager,5,51368
2,5,Employee 5,Marketing,Developer,6,50737
3,7,Employee 7,Marketing,Developer,1,56681
4,21,Employee 21,Marketing,Sales Executive,2,81403
5,23,Employee 23,Marketing,Sales Executive,3,75830
6,26,Employee 26,Marketing,Developer,7,44324
7,29,Employee 29,Marketing,Senior Analyst,8,39396
8,30,Employee 30,Marketing,Sales Executive,9,77080
9,31,Employee 31,Marketing,Developer,12,33918
10,39,Employee 39,Marketing,Developer,10,67237
11,40,Employee 40,Marketing,Assistant Manager,3,44165

In [248]:
df0

   sales_man_id sales_man_name sales_man_city  product_id manager
0             1           Asad        Karachi         123   Jawed
1             2         Sumair         Lahore         123   Jawed
2             3         Farjad        Karachi         145   Najam
3             4         Hassan         Lahore         567   Najam
4             5          Nasir      Hyderabad         234   Jawed
5             6         Kashif      Hyderabad         234  Faisal
6             7           Sana         Lahore         567  Faisal
7             8         Fatima        Karachi         345   Najam
8             9       Abdullah        Karachi         123  Faisal

In [249]:
df0

   sales_man_id sales_man_name sales_man_city  product_id manager
0             1           Asad        Karachi         123   Jawed
1             2         Sumair         Lahore         123   Jawed
2             3         Farjad        Karachi         145   Najam
3             4         Hassan         Lahore         567   Najam
4             5          Nasir      Hyderabad         234   Jawed
5             6         Kashif      Hyderabad         234  Faisal
6             7           Sana         Lahore         567  Faisal
7             8         Fatima        Karachi         345   Najam
8             9       Abdullah        Karachi         123  Faisal

In [250]:
df0.sales_man_name=='Fatima'

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: sales_man_name, dtype: bool

In [251]:
df2.sales_man_name=='Fatima '

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
Name: sales_man_name, dtype: bool

In [252]:
df2.sales_man_name = df2.sales_man_name.apply(lambda x: x.strip())
df2

  sales_man_name Region   Sales  Amount
0           Asad       A    100   100000
1        Hussain       B    300   450000
2            Ali       C    234   125000
3           Sana       D    231   652000
4         Fatima       E    324   145000
5         Kashif       F    123   825000
6         Hassan       G    129   125000
7          Almas       H    345   325600
8          Fahan       I    400   895200

In [253]:
df0.columns

Index(['sales_man_id', 'sales_man_name', 'sales_man_city', 'product_id',
       'manager'],
      dtype='object')

In [254]:
df2.columns

Index(['sales_man_name', 'Region ', 'Sales', 'Amount '], dtype='object')

In [255]:
# since we have not provided any column name as merger column 
# there is only one column with the same name (overlappig column)
# i t will by default merged on that single overlappping column.
merged_salesman_name = pd.merge(df2,df0)
merged_salesman_name

,sales_man_name,Region,Sales,Amount,sales_man_id,sales_man_city,product_id,manager
0,Asad,A,100,100000,1,Karachi,123,Jawed
1,Sana,D,231,652000,7,Lahore,567,Faisal
2,Fatima,E,324,145000,8,Karachi,345,Najam
3,Kashif,F,123,825000,6,Hyderabad,234,Faisal
4,Hassan,G,129,125000,4,Lahore,567,Najam

In [256]:
df0

   sales_man_id sales_man_name sales_man_city  product_id manager
0             1           Asad        Karachi         123   Jawed
1             2         Sumair         Lahore         123   Jawed
2             3         Farjad        Karachi         145   Najam
3             4         Hassan         Lahore         567   Najam
4             5          Nasir      Hyderabad         234   Jawed
5             6         Kashif      Hyderabad         234  Faisal
6             7           Sana         Lahore         567  Faisal
7             8         Fatima        Karachi         345   Najam
8             9       Abdullah        Karachi         123  Faisal

In [257]:
df1

    sales_man_id sales_man_name sales_man_city  product_id manager  Experience
0              1          Ahmed        Karachi         123   Jawed           2
1             22           Umer         Lahore         123   Jawed           3
2             33        Huzaifa        Karachi         145   Najam           4
3              4           Asad         Lahore         567   Najam           5
4             55        Hussain      Hyderabad         234   Jawed           6
5             66            Ali      Hyderabad         234  Faisal           7
6             77          Sadaf         Lahore         567  Faisal           8
7             88          Kiran        Karachi         345   Najam           9
8             99            Ali        Karachi         123  Faisal           1
9            101           Asad      Hyderabad         432   Jawed           4
10           101           Asad      Hyderabad         432   Jawed           5

# class 7 (23June2023)

In [258]:
# in case of df0 and df1 all the columns (more than one cloumn) is overlapping
# it will merge on first overlappiung column which is in our case "sales_man_id"
merged1 = pd.merge(df0,df1,on="sales_man_id")

In [259]:
merged1

,sales_man_id,sales_man_name_x,sales_man_city_x,product_id_x,manager_x,sales_man_name_y,sales_man_city_y,product_id_y,manager_y,Experience
0,1,Asad,Karachi,123,Jawed,Ahmed,Karachi,123,Jawed,2
1,4,Hassan,Lahore,567,Najam,Asad,Lahore,567,Najam,5

In [260]:
merged2 = pd.merge(df0,df1,on="sales_man_city")
merged2

,sales_man_id_x,sales_man_name_x,sales_man_city,product_id_x,manager_x,sales_man_id_y,sales_man_name_y,product_id_y,manager_y,Experience
0,1,Asad,Karachi,123,Jawed,1,Ahmed,123,Jawed,2
1,1,Asad,Karachi,123,Jawed,33,Huzaifa,145,Najam,4
2,1,Asad,Karachi,123,Jawed,88,Kiran,345,Najam,9
3,1,Asad,Karachi,123,Jawed,99,Ali,123,Faisal,1
4,3,Farjad,Karachi,145,Najam,1,Ahmed,123,Jawed,2
5,3,Farjad,Karachi,145,Najam,33,Huzaifa,145,Najam,4
6,3,Farjad,Karachi,145,Najam,88,Kiran,345,Najam,9
7,3,Farjad,Karachi,145,Najam,99,Ali,123,Faisal,1
8,8,Fatima,Karachi,345,Najam,1,Ahmed,123,Jawed,2
9,8,Fatima,Karachi,345,Najam,33,Huzaifa,145,Najam,4
10,8,Fatima,Karachi,345,Najam,88,Kiran,345,Najam,9
11,8,Fatima,Karachi,345,Najam,99,Ali,123,Faisal,1
12,9,Abdullah,Karachi,123,Faisal,1,Ahmed,123,Jawed,2
13,9,Abdullah,Karachi,123,Faisal,33,Huzaifa,145,Najam,4
14,9,Abdullah,Karachi,123,Faisal,88,Kiran,345,Najam,9
15,9,Abdullah,Karachi,123,Faisal,99,Ali,123,Faisal,1
16,2,Sumair,Lahore,123,Jawed,22,Umer,123,Jawed,3
17,2,Sumair,Lahore,123,Jawed,4,Asad,567,Najam,5
18,2,Sumair,Lahore,123,Jawed,77,Sadaf,567,Faisal,8
19,4,Hassan,Lahore,567,Najam,22,Umer,123,Jawed,3
20,4,Hassan,Lahore,567,Najam,4,Asad,567,Najam,5
21,4,Hassan,Lahore,567,Najam,77,Sadaf,567,Faisal,8
22,7,Sana,Lahore,567,Faisal,22,Umer,123,Jawed,3
23,7,Sana,Lahore,567,Faisal,4,Asad,567,Najam,5
24,7,Sana,Lahore,567,Faisal,77,Sadaf,567,Faisal,8
25,5,Nasir,Hyderabad,234,Jawed,55,Hussain,234,Jawed,6
26,5,Nasir,Hyderabad,234,Jawed,66,Ali,234,Faisal,7
27,5,Nasir,Hyderabad,234,Jawed,101,Asad,432,Jawed,4
28,5,Nasir,Hyderabad,234,Jawed,101,Asad,432,Jawed,5
29,6,Kashif,Hyderabad,234,Faisal,55,Hussain,234,Jawed,6
30,6,Kashif,Hyderabad,234,Faisal,66,Ali,234,Faisal,7
31,6,Kashif,Hyderabad,234,Faisal,101,Asad,432,Jawed,4
32,6,Kashif,Hyderabad,234,Faisal,101,Asad,432,Jawed,5

In [261]:
concatenated = pd.concat([df0,df1],axis=0)
concatenated

    sales_man_id sales_man_name sales_man_city  product_id manager  Experience
0              1           Asad        Karachi         123   Jawed         NaN
1              2         Sumair         Lahore         123   Jawed         NaN
2              3         Farjad        Karachi         145   Najam         NaN
3              4         Hassan         Lahore         567   Najam         NaN
4              5          Nasir      Hyderabad         234   Jawed         NaN
5              6         Kashif      Hyderabad         234  Faisal         NaN
6              7           Sana         Lahore         567  Faisal         NaN
7              8         Fatima        Karachi         345   Najam         NaN
8              9       Abdullah        Karachi         123  Faisal         NaN
0              1          Ahmed        Karachi         123   Jawed         2.0
1             22           Umer         Lahore         123   Jawed         3.0
2             33        Huzaifa        Karachi         145   Najam         4.0
3              4           Asad         Lahore         567   Najam         5.0
4             55        Hussain      Hyderabad         234   Jawed         6.0
5             66            Ali      Hyderabad         234  Faisal         7.0
6             77          Sadaf         Lahore         567  Faisal         8.0
7             88          Kiran        Karachi         345   Najam         9.0
8             99            Ali        Karachi         123  Faisal         1.0
9            101           Asad      Hyderabad         432   Jawed         4.0
10           101           Asad      Hyderabad         432   Jawed         5.0

In [262]:
df3 = pd.read_excel("test_data.xlsx",sheet_name=3)
df2 = pd.read_excel("test_data.xlsx",sheet_name=2)
df1 = pd.read_excel("test_data.xlsx",sheet_name=1)
df0 = pd.read_excel("test_data.xlsx",sheet_name=0)

In [263]:
df3

      name Area  Qunaity   Total
0     Asad    A      100  100000
1  Hussain    B      300  450000
2      Ali    C      234  125000
3     Sana    D      231  652000
4  Fatima     E      324  145000
5   Kashif    F      123  825000
6   Hassan    G      129  125000
7    Almas    H      345  325600
8    Fahan    I      400  895200

In [264]:
df2

  sales_man_name Region   Sales  Amount
0           Asad       A    100   100000
1        Hussain       B    300   450000
2            Ali       C    234   125000
3           Sana       D    231   652000
4        Fatima        E    324   145000
5         Kashif       F    123   825000
6         Hassan       G    129   125000
7          Almas       H    345   325600
8          Fahan       I    400   895200

In [265]:
pd.merge(df3,df2,how='inner',left_on=['name'], right_on=['sales_man_name'])

      name Area  Qunaity   Total sales_man_name Region   Sales  Amount
0     Asad    A      100  100000           Asad       A    100   100000
1  Hussain    B      300  450000        Hussain       B    300   450000
2      Ali    C      234  125000            Ali       C    234   125000
3     Sana    D      231  652000           Sana       D    231   652000
4  Fatima     E      324  145000        Fatima        E    324   145000
5   Kashif    F      123  825000         Kashif       F    123   825000
6   Hassan    G      129  125000         Hassan       G    129   125000
7    Almas    H      345  325600          Almas       H    345   325600
8    Fahan    I      400  895200          Fahan       I    400   895200

In [266]:
df1

    sales_man_id sales_man_name sales_man_city  product_id manager  Experience
0              1          Ahmed        Karachi         123   Jawed           2
1             22           Umer         Lahore         123   Jawed           3
2             33        Huzaifa        Karachi         145   Najam           4
3              4           Asad         Lahore         567   Najam           5
4             55        Hussain      Hyderabad         234   Jawed           6
5             66            Ali      Hyderabad         234  Faisal           7
6             77          Sadaf         Lahore         567  Faisal           8
7             88          Kiran        Karachi         345   Najam           9
8             99            Ali        Karachi         123  Faisal           1
9            101           Asad      Hyderabad         432   Jawed           4
10           101           Asad      Hyderabad         432   Jawed           5

In [267]:
pd.merge(df3,df1, left_on='name', right_on='sales_man_name')

,name,Area,Qunaity,Total,sales_man_id,sales_man_name,sales_man_city,product_id,manager,Experience
0,Asad,A,100,100000,4,Asad,Lahore,567,Najam,5
1,Asad,A,100,100000,101,Asad,Hyderabad,432,Jawed,4
2,Asad,A,100,100000,101,Asad,Hyderabad,432,Jawed,5
3,Hussain,B,300,450000,55,Hussain,Hyderabad,234,Jawed,6
4,Ali,C,234,125000,66,Ali,Hyderabad,234,Faisal,7
5,Ali,C,234,125000,99,Ali,Karachi,123,Faisal,1

In [268]:
df3.head()
df3.tail()
df3.sample(5)

     name Area  Qunaity   Total
0    Asad    A      100  100000
5  Kashif    F      123  825000
3    Sana    D      231  652000
7   Almas    H      345  325600
6  Hassan    G      129  125000

# Outer Merge: Union
#  Inner Merge: Intersection

In [269]:
df2

  sales_man_name Region   Sales  Amount
0           Asad       A    100   100000
1        Hussain       B    300   450000
2            Ali       C    234   125000
3           Sana       D    231   652000
4        Fatima        E    324   145000
5         Kashif       F    123   825000
6         Hassan       G    129   125000
7          Almas       H    345   325600
8          Fahan       I    400   895200

In [270]:
df1

    sales_man_id sales_man_name sales_man_city  product_id manager  Experience
0              1          Ahmed        Karachi         123   Jawed           2
1             22           Umer         Lahore         123   Jawed           3
2             33        Huzaifa        Karachi         145   Najam           4
3              4           Asad         Lahore         567   Najam           5
4             55        Hussain      Hyderabad         234   Jawed           6
5             66            Ali      Hyderabad         234  Faisal           7
6             77          Sadaf         Lahore         567  Faisal           8
7             88          Kiran        Karachi         345   Najam           9
8             99            Ali        Karachi         123  Faisal           1
9            101           Asad      Hyderabad         432   Jawed           4
10           101           Asad      Hyderabad         432   Jawed           5

In [271]:
pd.merge(df2,df1, how='outer')

,sales_man_name,Region,Sales,Amount,sales_man_id,sales_man_city,product_id,manager,Experience
0,Asad,A,100.0,100000.0,4.0,Lahore,567.0,Najam,5.0
1,Asad,A,100.0,100000.0,101.0,Hyderabad,432.0,Jawed,4.0
2,Asad,A,100.0,100000.0,101.0,Hyderabad,432.0,Jawed,5.0
3,Hussain,B,300.0,450000.0,55.0,Hyderabad,234.0,Jawed,6.0
4,Ali,C,234.0,125000.0,66.0,Hyderabad,234.0,Faisal,7.0
5,Ali,C,234.0,125000.0,99.0,Karachi,123.0,Faisal,1.0
6,Sana,D,231.0,652000.0,NaN,NaN,NaN,NaN,NaN
7,Fatima,E,324.0,145000.0,NaN,NaN,NaN,NaN,NaN
8,Kashif,F,123.0,825000.0,NaN,NaN,NaN,NaN,NaN
9,Hassan,G,129.0,125000.0,NaN,NaN,NaN,NaN,NaN
10,Almas,H,345.0,325600.0,NaN,NaN,NaN,NaN,NaN
11,Fahan,I,400.0,895200.0,NaN,NaN,NaN,NaN,NaN
12,Ahmed,NaN,NaN,NaN,1.0,Karachi,123.0,Jawed,2.0
13,Umer,NaN,NaN,NaN,22.0,Lahore,123.0,Jawed,3.0
14,Huzaifa,NaN,NaN,NaN,33.0,Karachi,145.0,Najam,4.0
15,Sadaf,NaN,NaN,NaN,77.0,Lahore,567.0,Faisal,8.0
16,Kiran,NaN,NaN,NaN,88.0,Karachi,345.0,Najam,9.0

# Outer Merge: Union
# Inner Merge: Intersection
# Left Merge:  It works like half union and half intersection
# Right Merger: It works like half union and half intersection

In [272]:
df1

    sales_man_id sales_man_name sales_man_city  product_id manager  Experience
0              1          Ahmed        Karachi         123   Jawed           2
1             22           Umer         Lahore         123   Jawed           3
2             33        Huzaifa        Karachi         145   Najam           4
3              4           Asad         Lahore         567   Najam           5
4             55        Hussain      Hyderabad         234   Jawed           6
5             66            Ali      Hyderabad         234  Faisal           7
6             77          Sadaf         Lahore         567  Faisal           8
7             88          Kiran        Karachi         345   Najam           9
8             99            Ali        Karachi         123  Faisal           1
9            101           Asad      Hyderabad         432   Jawed           4
10           101           Asad      Hyderabad         432   Jawed           5

In [273]:
df0

   sales_man_id sales_man_name sales_man_city  product_id manager
0             1           Asad        Karachi         123   Jawed
1             2         Sumair         Lahore         123   Jawed
2             3         Farjad        Karachi         145   Najam
3             4         Hassan         Lahore         567   Najam
4             5          Nasir      Hyderabad         234   Jawed
5             6         Kashif      Hyderabad         234  Faisal
6             7           Sana         Lahore         567  Faisal
7             8         Fatima        Karachi         345   Najam
8             9       Abdullah        Karachi         123  Faisal

In [274]:
pd.merge(df0,df1, how='inner', on='sales_man_id')

,sales_man_id,sales_man_name_x,sales_man_city_x,product_id_x,manager_x,sales_man_name_y,sales_man_city_y,product_id_y,manager_y,Experience
0,1,Asad,Karachi,123,Jawed,Ahmed,Karachi,123,Jawed,2
1,4,Hassan,Lahore,567,Najam,Asad,Lahore,567,Najam,5

In [275]:
pd.merge(df0,df1, how='outer', on='sales_man_id')

,sales_man_id,sales_man_name_x,sales_man_city_x,product_id_x,manager_x,sales_man_name_y,sales_man_city_y,product_id_y,manager_y,Experience
0,1,Asad,Karachi,123.0,Jawed,Ahmed,Karachi,123.0,Jawed,2.0
1,2,Sumair,Lahore,123.0,Jawed,NaN,NaN,NaN,NaN,NaN
2,3,Farjad,Karachi,145.0,Najam,NaN,NaN,NaN,NaN,NaN
3,4,Hassan,Lahore,567.0,Najam,Asad,Lahore,567.0,Najam,5.0
4,5,Nasir,Hyderabad,234.0,Jawed,NaN,NaN,NaN,NaN,NaN
5,6,Kashif,Hyderabad,234.0,Faisal,NaN,NaN,NaN,NaN,NaN
6,7,Sana,Lahore,567.0,Faisal,NaN,NaN,NaN,NaN,NaN
7,8,Fatima,Karachi,345.0,Najam,NaN,NaN,NaN,NaN,NaN
8,9,Abdullah,Karachi,123.0,Faisal,NaN,NaN,NaN,NaN,NaN
9,22,NaN,NaN,NaN,NaN,Umer,Lahore,123.0,Jawed,3.0
10,33,NaN,NaN,NaN,NaN,Huzaifa,Karachi,145.0,Najam,4.0
11,55,NaN,NaN,NaN,NaN,Hussain,Hyderabad,234.0,Jawed,6.0
12,66,NaN,NaN,NaN,NaN,Ali,Hyderabad,234.0,Faisal,7.0
13,77,NaN,NaN,NaN,NaN,Sadaf,Lahore,567.0,Faisal,8.0
14,88,NaN,NaN,NaN,NaN,Kiran,Karachi,345.0,Najam,9.0
15,99,NaN,NaN,NaN,NaN,Ali,Karachi,123.0,Faisal,1.0
16,101,NaN,NaN,NaN,NaN,Asad,Hyderabad,432.0,Jawed,4.0
17,101,NaN,NaN,NaN,NaN,Asad,Hyderabad,432.0,Jawed,5.0

In [276]:
pd.merge(df0,df1, how='left', on='sales_man_id')# left has priority means all records of left frame must be in new df.

,sales_man_id,sales_man_name_x,sales_man_city_x,product_id_x,manager_x,sales_man_name_y,sales_man_city_y,product_id_y,manager_y,Experience
0,1,Asad,Karachi,123,Jawed,Ahmed,Karachi,123.0,Jawed,2.0
1,2,Sumair,Lahore,123,Jawed,NaN,NaN,NaN,NaN,NaN
2,3,Farjad,Karachi,145,Najam,NaN,NaN,NaN,NaN,NaN
3,4,Hassan,Lahore,567,Najam,Asad,Lahore,567.0,Najam,5.0
4,5,Nasir,Hyderabad,234,Jawed,NaN,NaN,NaN,NaN,NaN
5,6,Kashif,Hyderabad,234,Faisal,NaN,NaN,NaN,NaN,NaN
6,7,Sana,Lahore,567,Faisal,NaN,NaN,NaN,NaN,NaN
7,8,Fatima,Karachi,345,Najam,NaN,NaN,NaN,NaN,NaN
8,9,Abdullah,Karachi,123,Faisal,NaN,NaN,NaN,NaN,NaN

In [277]:
pd.merge(df0,df1, how='right', on='sales_man_id')# right has priority means all records of right frame must be in new df.

,sales_man_id,sales_man_name_x,sales_man_city_x,product_id_x,manager_x,sales_man_name_y,sales_man_city_y,product_id_y,manager_y,Experience
0,1,Asad,Karachi,123.0,Jawed,Ahmed,Karachi,123,Jawed,2
1,22,NaN,NaN,NaN,NaN,Umer,Lahore,123,Jawed,3
2,33,NaN,NaN,NaN,NaN,Huzaifa,Karachi,145,Najam,4
3,4,Hassan,Lahore,567.0,Najam,Asad,Lahore,567,Najam,5
4,55,NaN,NaN,NaN,NaN,Hussain,Hyderabad,234,Jawed,6
5,66,NaN,NaN,NaN,NaN,Ali,Hyderabad,234,Faisal,7
6,77,NaN,NaN,NaN,NaN,Sadaf,Lahore,567,Faisal,8
7,88,NaN,NaN,NaN,NaN,Kiran,Karachi,345,Najam,9
8,99,NaN,NaN,NaN,NaN,Ali,Karachi,123,Faisal,1
9,101,NaN,NaN,NaN,NaN,Asad,Hyderabad,432,Jawed,4
10,101,NaN,NaN,NaN,NaN,Asad,Hyderabad,432,Jawed,5

# Class8(29thJune)

### Grouping - Group By.

In [278]:
import pandas as pd
import numpy as np

In [279]:
url1 = 'https://raw.githubusercontent.com/FBosler/Medium-Data-Exploration/master/order_leads.csv'
url2 = 'https://raw.githubusercontent.com/FBosler/Medium-Data-Exploration/master/sales_team.csv'

In [280]:
order_leads = pd.read_csv(url1,parse_dates=[3])
sales_team = pd.read_csv(url2)

In [281]:
order_leads.shape

(100000, 6)

In [282]:
order_leads.head(10)

,Order Id,Company Id,Company Name,Date,Order Value,Converted
0,HZSXLI1IS9RGABZW,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-10-13,6952,0
1,582WPS3OW8T6YT0R,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-09-02,7930,0
2,KRF65MQZBOYG4Y9T,D0AUXPP07H6AVSGD,Melancholy Social-Role,2016-12-21,5538,1
3,N3EDZ5V1WGSWW828,D0AUXPP07H6AVSGD,Melancholy Social-Role,2018-06-03,1113,0
4,QXBC8COXEXGFSPLP,D0AUXPP07H6AVSGD,Melancholy Social-Role,2014-07-26,4596,0
5,CQKV2CTU29CVIBV7,D0AUXPP07H6AVSGD,Melancholy Social-Role,2015-07-16,1304,0
6,7V1CDIHQAPCGRJZ2,D0AUXPP07H6AVSGD,Melancholy Social-Role,2014-12-17,4610,0
7,JFMNRRRNS5MD8BKQ,D0AUXPP07H6AVSGD,Melancholy Social-Role,2018-02-27,8349,1
8,8NAXO48R22240WYE,D0AUXPP07H6AVSGD,Melancholy Social-Role,2015-12-23,4881,0
9,FNY1AMVZH2OGPTK6,D0AUXPP07H6AVSGD,Melancholy Social-Role,2015-03-03,9606,0

In [283]:
order_leads.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Order Id      100000 non-null  object
 1   Company Id    100000 non-null  object
 2   Company Name  100000 non-null  object
 3   Date          100000 non-null  datetime64[ns]
 4   Order Value   100000 non-null  int64
 5   Converted     100000 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 4.6+ MB

In [284]:
# if we dont parse the date when loading data, we will convert the date explicitly
pd.to_datetime(order_leads['Date'])

0       2017-10-13
1       2017-09-02
2       2016-12-21
3       2018-06-03
4       2014-07-26
           ...
99995   2017-11-06
99996   2018-08-02
99997   2014-11-02
99998   2017-04-01
99999   2016-07-27
Name: Date, Length: 100000, dtype: datetime64[ns]

In [285]:
sales_team.shape

(4619, 4)

In [286]:
sales_team.head(10)

        Sales Rep      Sales Rep Id            Company Name        Company Id
0  William Taylor  ZTZA0ZLYZR85PTUJ  Melancholy Social-Role  D0AUXPP07H6AVSGD
1  William Taylor  ZTZA0ZLYZR85PTUJ          Pee-Wee Pigeon  TJW99R4RWH02INII
2  William Taylor  ZTZA0ZLYZR85PTUJ     Vaginal 36-Year-Old  3S20IO1O1DYXMUNU
3  William Taylor  ZTZA0ZLYZR85PTUJ    Unhurried Musician'S  FDWW0TQRPGMVI2A7
4  William Taylor  ZTZA0ZLYZR85PTUJ     Comprehensive Lists  C30FY83UNLVBA0O3
5  William Taylor  ZTZA0ZLYZR85PTUJ         Off-Beat Anthea  6NHGP9YC7CTBARBG
6  William Taylor  ZTZA0ZLYZR85PTUJ    Pearl-Gray Midstream  JSG0N4TPIDMQOR4A
7  William Taylor  ZTZA0ZLYZR85PTUJ    Unaggressive Quality  AJ4EWVZKZGX0KBC9
8  William Taylor  ZTZA0ZLYZR85PTUJ    Astral Circumference  ZVKRKS0N8FAMWU8C
9  William Taylor  ZTZA0ZLYZR85PTUJ      Greasy Transitions  CLSTQXCAABBWSQ8K

In [361]:
df = pd.merge(sales_team,order_leads,on=['Company Name','Company Id'])

In [362]:
df.head()

,Sales Rep,Sales Rep Id,Company Name,Company Id,Order Id,Date,Order Value,Converted
0,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,HZSXLI1IS9RGABZW,2017-10-13,6952,0
1,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,582WPS3OW8T6YT0R,2017-09-02,7930,0
2,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,KRF65MQZBOYG4Y9T,2016-12-21,5538,1
3,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,N3EDZ5V1WGSWW828,2018-06-03,1113,0
4,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,QXBC8COXEXGFSPLP,2014-07-26,4596,0

In [289]:
df['Sales Rep'].value_counts()

Sales Rep
Jessica Renner      430
Alyssa Mckinney     428
Elizabeth Gaddy     416
Susan Gutierrez     415
Georgiann White     413
                   ...
Viola Ates           18
Debra Vermillion     17
Alfredo Weise        17
Simon Hearn          15
Robert Bowen         15
Name: count, Length: 499, dtype: int64

In [290]:
df.rename(columns={'Sales Rep':'sales_rep',"Company Name":"company_name", "Order Value":"order_value"},inplace=True)

In [291]:
df.head()

,sales_rep,Sales Rep Id,company_name,Company Id,Order Id,Date,order_value,Converted
0,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,HZSXLI1IS9RGABZW,2017-10-13,6952,0
1,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,582WPS3OW8T6YT0R,2017-09-02,7930,0
2,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,KRF65MQZBOYG4Y9T,2016-12-21,5538,1
3,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,N3EDZ5V1WGSWW828,2018-06-03,1113,0
4,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,QXBC8COXEXGFSPLP,2014-07-26,4596,0

In [292]:
df.groupby('sales_rep')

In [293]:
df.groupby('sales_rep').groups

{'Aaron Hendrickson': [25612, 25613, 25614, 25615, 25616, 25617, 25618, 25619, 25620, 25621, 25622, 25623, 25624, 25625, 25626, 25627, 25628, 25629, 25630, 25631, 25632, 25633, 25634, 25635, 25636, 25637, 25638, 25639, 25640, 25641, 25642, 25643, 25644, 25645, 25646, 25647, 25648, 25649, 25650, 25651, 25652, 25653, 25654, 25655, 25656, 25657, 25658, 25659, 25660, 25661, 25662, 25663, 25664, 25665, 25666, 25667, 25668, 25669, 25670, 25671, 25672, 25673, 25674, 25675, 25676, 25677, 25678, 25679, 25680, 25681, 25682, 25683, 25684, 25685, 25686, 25687, 25688, 25689, 25690, 25691, 25692, 25693, 25694, 25695, 25696, 25697, 25698, 25699, 25700, 25701, 25702, 25703, 25704, 25705, 25706, 25707, 25708, 25709, 25710, 25711, ...], 'Adam Sawyer': [67140, 67141, 67142, 67143, 67144, 67145, 67146, 67147, 67148, 67149, 67150, 67151, 67152, 67153, 67154, 67155, 67156, 67157, 67158, 67159, 67160, 67161, 67162, 67163, 67164, 67165, 67166, 67167, 67168, 67169, 67170, 67171, 67172, 67173, 67174, 67175, 67176, 67177, 67178, 67179, 67180, 67181, 67182, 67183, 67184, 67185, 67186, 67187, 67188, 67189, 67190, 67191, 67192, 67193, 67194, 67195, 67196, 67197, 67198, 67199, 67200, 67201, 67202, 67203, 67204, 67205, 67206, 67207, 67208, 67209, 67210, 67211, 67212, 67213, 67214, 67215, 67216, 67217, 67218, 67219, 67220, 67221, 67222, 67223, 67224, 67225, 67226, 67227, 67228, 67229, 67230, 67231, 67232, 67233, 67234, 67235, 67236, 67237, 67238, 67239, ...], 'Adele Kimmel': [90915, 90916, 90917, 90918, 90919, 90920, 90921, 90922, 90923, 90924, 90925, 90926, 90927, 90928, 90929, 90930, 90931, 90932, 90933, 90934, 90935, 90936, 90937, 90938, 90939, 90940, 90941, 90942, 90943, 90944, 90945, 90946, 90947, 90948, 90949, 90950, 90951, 90952, 90953, 90954, 90955, 90956, 90957, 90958, 90959, 90960, 90961, 90962, 90963, 90964, 90965, 90966, 90967, 90968, 90969, 90970, 90971, 90972, 90973, 90974, 90975, 90976, 90977, 90978, 90979, 90980, 90981, 90982, 90983, 90984, 90985, 90986, 90987, 90988, 90989, 90990, 90991, 90992, 90993, 90994, 90995, 90996, 90997, 90998, 90999, 91000, 91001, 91002, 91003, 91004, 91005, 91006, 91007, 91008, 91009, 91010, 91011, 91012, 91013, 91014, ...], 'Adrian Daugherty': [31483, 31484, 31485, 31486, 31487, 31488, 31489, 31490, 31491, 31492, 31493, 31494, 31495, 31496, 31497, 31498, 31499, 31500, 31501, 31502, 31503, 31504, 31505, 31506, 31507, 31508, 31509, 31510, 31511, 31512, 31513, 31514, 31515, 31516, 31517, 31518, 31519, 31520, 31521, 31522, 31523, 31524, 31525, 31526, 31527, 31528, 31529, 31530, 31531, 31532, 31533, 31534, 31535, 31536, 31537, 31538, 31539, 31540, 31541, 31542, 31543, 31544, 31545, 31546, 31547, 31548, 31549, 31550, 31551, 31552, 31553, 31554, 31555, 31556, 31557, 31558, 31559, 31560, 31561, 31562, 31563, 31564, 31565, 31566, 31567, 31568, 31569, 31570, 31571, 31572, 31573, 31574, 31575, 31576, 31577, 31578, 31579, 31580, 31581, 31582, ...], 'Adrianna Shelton': [3368, 3369, 3370, 3371, 3372, 3373, 3374, 3375, 3376, 3377, 3378, 3379, 3380, 3381, 3382, 3383, 3384, 3385, 3386, 3387, 3388, 3389, 3390, 3391, 3392, 3393, 3394, 3395, 3396, 3397, 3398, 3399, 3400, 3401, 3402, 3403, 3404], 'Ahmad Derck': [44306, 44307, 44308, 44309, 44310, 44311, 44312, 44313, 44314, 44315, 44316, 44317, 44318, 44319, 44320, 44321, 44322, 44323, 44324, 44325, 44326, 44327, 44328, 44329, 44330, 44331, 44332, 44333, 44334, 44335, 44336, 44337, 44338, 44339, 44340, 44341, 44342, 44343, 44344, 44345, 44346, 44347, 44348, 44349, 44350, 44351, 44352, 44353, 44354, 44355, 44356, 44357, 44358, 44359, 44360, 44361, 44362, 44363, 44364, 44365, 44366, 44367, 44368, 44369, 44370, 44371, 44372, 44373, 44374, 44375, 44376, 44377, 44378, 44379, 44380, 44381, 44382, 44383, 44384, 44385, 44386, 44387, 44388, 44389, 44390, 44391, 44392, 44393, 44394, 44395, 44396, 44397, 44398, 44399, 44400, 44401, 44402, 44403, 44404, 44405, ...], 'Albert Pellowski': [26755, 26756, 26757, 26758, 26759, 26760, 26761, 26762, 26763, 26764, 26765, 26766, 26767, 26768, 26769, 26770, 26771, 26772, 26773, 26774, 26775, 26776, 26777, 26778, 26779, 26780, 26781, 26782, 26783, 26784, 26785, 26786, 26787, 26788, 26789, 26790, 26791, 26792, 26793, 26794, 26795, 26796, 26797, 26798, 26799, 26800, 26801, 26802, 26803, 26804, 26805, 26806, 26807, 26808, 26809, 26810, 26811, 26812, 26813, 26814], 'Alease Puckett': [91425, 91426, 91427, 91428, 91429, 91430, 91431, 91432, 91433, 91434, 91435, 91436, 91437, 91438, 91439, 91440, 91441, 91442, 91443, 91444, 91445, 91446, 91447, 91448, 91449, 91450, 91451, 91452, 91453, 91454, 91455, 91456, 91457, 91458, 91459, 91460, 91461, 91462, 91463, 91464, 91465, 91466, 91467, 91468, 91469, 91470, 91471, 91472, 91473, 91474, 91475, 91476, 91477, 91478, 91479, 91480, 91481, 91482, 91483, 91484, 91485, 91486, 91487, 91488, 91489, 91490, 91491, 91492, 91493, 91494, 91495, 91496, 91497, 91498, 91499, 91500, 91501, 91502, 91503, 91504, 91505, 91506, 91507, 91508, 91509, 91510, 91511, 91512, 91513, 91514, 91515, 91516, 91517, 91518, 91519, 91520, 91521, 91522, 91523, 91524, ...], 'Alejandro Ford': [43508, 43509, 43510, 43511, 43512, 43513, 43514, 43515, 43516, 43517, 43518, 43519, 43520, 43521, 43522, 43523, 43524, 43525, 43526, 43527, 43528, 43529, 43530, 43531, 43532, 43533, 43534, 43535, 43536, 43537, 43538, 43539, 43540, 43541, 43542, 43543, 43544, 43545, 43546, 43547, 43548, 43549, 43550, 43551, 43552, 43553, 43554, 43555, 43556, 43557, 43558, 43559, 43560, 43561, 43562, 43563, 43564], 'Alfredo Weise': [54004, 54005, 54006, 54007, 54008, 54009, 54010, 54011, 54012, 54013, 54014, 54015, 54016, 54017, 54018, 54019, 54020], 'Alison Mitchell': [81217, 81218, 81219, 81220, 81221, 81222, 81223, 81224, 81225, 81226, 81227, 81228, 81229, 81230, 81231, 81232, 81233, 81234, 81235, 81236, 81237, 81238], 'Allen Olding': [51024, 51025, 51026, 51027, 51028, 51029, 51030, 51031, 51032, 51033, 51034, 51035, 51036, 51037, 51038, 51039, 51040, 51041, 51042, 51043, 51044, 51045, 51046, 51047, 51048, 51049, 51050, 51051, 51052, 51053, 51054, 51055, 51056, 51057, 51058, 51059, 51060, 51061, 51062, 51063, 51064, 51065, 51066, 51067, 51068, 51069, 51070, 51071, 51072, 51073, 51074, 51075, 51076, 51077, 51078, 51079, 51080, 51081, 51082, 51083, 51084, 51085, 51086, 51087, 51088, 51089, 51090, 51091, 51092, 51093, 51094, 51095, 51096, 51097, 51098, 51099, 51100, 51101, 51102, 51103, 51104, 51105, 51106, 51107, 51108, 51109, 51110, 51111, 51112, 51113, 51114, 51115, 51116, 51117, 51118, 51119, 51120, 51121, 51122, 51123, ...], 'Allison Malinski': [38283, 38284, 38285, 38286, 38287, 38288, 38289, 38290, 38291, 38292, 38293, 38294, 38295, 38296, 38297, 38298, 38299, 38300, 38301, 38302, 38303, 38304, 38305, 38306, 38307, 38308, 38309, 38310, 38311, 38312, 38313, 38314, 38315, 38316, 38317, 38318, 38319, 38320, 38321, 38322, 38323, 38324, 38325, 38326, 38327, 38328, 38329, 38330, 38331, 38332, 38333, 38334, 38335, 38336, 38337, 38338, 38339, 38340, 38341, 38342, 38343, 38344, 38345, 38346, 38347, 38348, 38349, 38350, 38351, 38352, 38353, 38354, 38355, 38356, 38357, 38358, 38359, 38360, 38361, 38362, 38363, 38364, 38365, 38366, 38367, 38368, 38369, 38370, 38371, 38372, 38373, 38374, 38375, 38376, 38377, 38378, 38379, 38380, 38381, 38382, ...], 'Alonzo Cavanaugh': [60846, 60847, 60848, 60849, 60850, 60851, 60852, 60853, 60854, 60855, 60856, 60857, 60858, 60859, 60860, 60861, 60862, 60863, 60864, 60865, 60866, 60867, 60868, 60869, 60870, 60871, 60872, 60873, 60874, 60875, 60876, 60877, 60878, 60879, 60880, 60881, 60882, 60883, 60884, 60885, 60886, 60887, 60888, 60889, 60890, 60891, 60892, 60893, 60894, 60895], 'Alvin Greene': [37043, 37044, 37045, 37046, 37047, 37048, 37049, 37050, 37051, 37052, 37053, 37054, 37055, 37056, 37057, 37058, 37059, 37060, 37061, 37062, 37063, 37064, 37065, 37066, 37067, 37068, 37069, 37070, 37071, 37072, 37073, 37074, 37075, 37076, 37077, 37078, 37079, 37080, 37081, 37082, 37083, 37084, 37085, 37086, 37087, 37088, 37089, 37090, 37091, 37092, 37093, 37094, 37095, 37096, 37097, 37098, 37099, 37100, 37101, 37102, 37103, 37104, 37105, 37106, 37107, 37108, 37109, 37110, 37111, 37112, 37113, 37114, 37115, 37116, 37117, 37118, 37119, 37120, 37121, 37122, 37123, 37124, 37125, 37126, 37127, 37128, 37129, 37130], 'Alvin Jenson': [477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, ...], 'Alyssa Mckinney': [92364, 92365, 92366, 92367, 92368, 92369, 92370, 92371, 92372, 92373, 92374, 92375, 92376, 92377, 92378, 92379, 92380, 92381, 92382, 92383, 92384, 92385, 92386, 92387, 92388, 92389, 92390, 92391, 92392, 92393, 92394, 92395, 92396, 92397, 92398, 92399, 92400, 92401, 92402, 92403, 92404, 92405, 92406, 92407, 92408, 92409, 92410, 92411, 92412, 92413, 92414, 92415, 92416, 92417, 92418, 92419, 92420, 92421, 92422, 92423, 92424, 92425, 92426, 92427, 92428, 92429, 92430, 92431, 92432, 92433, 92434, 92435, 92436, 92437, 92438, 92439, 92440, 92441, 92442, 92443, 92444, 92445, 92446, 92447, 92448, 92449, 92450, 92451, 92452, 92453, 92454, 92455, 92456, 92457, 92458, 92459, 92460, 92461, 92462, 92463, ...], 'Amanda Borkholder': [52332, 52333, 52334, 52335, 52336, 52337, 52338, 52339, 52340, 52341, 52342, 52343, 52344, 52345, 52346, 52347, 52348, 52349, 52350, 52351, 52352, 52353, 52354, 52355, 52356, 52357, 52358, 52359, 52360, 52361, 52362, 52363, 52364, 52365, 52366, 52367, 52368, 52369, 52370, 52371, 52372, 52373, 52374, 52375, 52376, 52377, 52378, 52379, 52380, 52381, 52382, 52383, 52384, 52385, 52386, 52387, 52388, 52389, 52390, 52391, 52392, 52393, 52394, 52395, 52396, 52397, 52398, 52399, 52400, 52401, 52402, 52403, 52404, 52405, 52406, 52407, 52408, 52409, 52410, 52411, 52412, 52413, 52414, 52415, 52416, 52417, 52418, 52419, 52420, 52421, 52422, 52423, 52424, 52425, 52426, 52427, 52428, 52429, 52430, 52431, ...], 'Amy Jernigan': [39838, 39839, 39840, 39841, 39842, 39843, 39844, 39845, 39846, 39847, 39848, 39849, 39850, 39851, 39852, 39853, 39854, 39855, 39856, 39857, 39858, 39859, 39860, 39861, 39862, 39863, 39864, 39865, 39866, 39867, 39868, 39869, 39870, 39871, 39872, 39873, 39874, 39875, 39876, 39877, 39878, 39879, 39880, 39881, 39882, 39883, 39884, 39885, 39886, 39887, 39888, 39889, 39890, 39891, 39892, 39893, 39894, 39895, 39896, 39897, 39898, 39899, 39900, 39901, 39902, 39903, 39904, 39905, 39906, 39907, 39908, 39909, 39910, 39911, 39912, 39913, 39914, 39915, 39916, 39917, 39918, 39919, 39920, 39921, 39922, 39923, 39924, 39925, 39926, 39927, 39928, 39929, 39930], 'Andrea Kanish': [32996, 32997, 32998, 32999, 33000, 33001, 33002, 33003, 33004, 33005, 33006, 33007, 33008, 33009, 33010, 33011, 33012, 33013, 33014, 33015, 33016, 33017, 33018, 33019, 33020, 33021, 33022, 33023, 33024, 33025, 33026, 33027, 33028, 33029, 33030, 33031, 33032, 33033, 33034, 33035, 33036, 33037, 33038, 33039, 33040, 33041, 33042, 33043, 33044, 33045, 33046, 33047, 33048, 33049, 33050, 33051, 33052, 33053, 33054, 33055, 33056, 33057, 33058, 33059, 33060, 33061, 33062, 33063, 33064, 33065, 33066, 33067, 33068, 33069, 33070, 33071, 33072, 33073, 33074, 33075, 33076, 33077, 33078, 33079, 33080, 33081, 33082, 33083, 33084, 33085, 33086, 33087, 33088, 33089, 33090, 33091, 33092, 33093, 33094, 33095, ...], 'Angel Guidry': [56561, 56562, 56563, 56564, 56565, 56566, 56567, 56568, 56569, 56570, 56571, 56572, 56573, 56574, 56575, 56576, 56577, 56578, 56579, 56580, 56581, 56582, 56583, 56584, 56585, 56586, 56587, 56588, 56589, 56590, 56591, 56592, 56593, 56594, 56595, 56596, 56597, 56598, 56599, 56600, 56601, 56602, 56603, 56604, 56605, 56606, 56607, 56608, 56609, 56610, 56611, 56612, 56613, 56614, 56615, 56616, 56617, 56618, 56619, 56620, 56621, 56622, 56623, 56624, 56625, 56626, 56627, 56628, 56629, 56630, 56631, 56632, 56633, 56634, 56635, 56636, 56637, 56638, 56639, 56640, 56641, 56642, 56643, 56644, 56645, 56646, 56647, 56648, 56649, 56650, 56651, 56652, 56653, 56654, 56655, 56656, 56657, 56658, 56659, 56660, ...], 'Angela Long': [67464, 67465, 67466, 67467, 67468, 67469, 67470, 67471, 67472, 67473, 67474, 67475, 67476, 67477, 67478, 67479, 67480, 67481, 67482, 67483, 67484, 67485, 67486, 67487, 67488, 67489, 67490, 67491, 67492, 67493, 67494, 67495, 67496, 67497, 67498, 67499, 67500, 67501, 67502, 67503, 67504, 67505, 67506, 67507, 67508, 67509, 67510, 67511, 67512, 67513, 67514, 67515, 67516, 67517, 67518, 67519, 67520, 67521, 67522, 67523, 67524, 67525, 67526, 67527, 67528, 67529, 67530, 67531, 67532, 67533, 67534, 67535, 67536, 67537, 67538, 67539, 67540, 67541, 67542, 67543, 67544, 67545, 67546, 67547, 67548, 67549, 67550, 67551, 67552, 67553, 67554, 67555, 67556, 67557, 67558, 67559, 67560, 67561, 67562, 67563, ...], 'Angela Messner': [30941, 30942, 30943, 30944, 30945, 30946, 30947, 30948, 30949, 30950, 30951, 30952, 30953, 30954, 30955, 30956, 30957, 30958, 30959, 30960, 30961, 30962, 30963, 30964, 30965, 30966, 30967, 30968, 30969, 30970, 30971, 30972, 30973, 30974, 30975, 30976, 30977, 30978, 30979, 30980, 30981, 30982, 30983, 30984, 30985, 30986, 30987, 30988, 30989, 30990, 30991, 30992, 30993, 30994, 30995, 30996, 30997, 30998, 30999, 31000, 31001, 31002, 31003, 31004, 31005, 31006, 31007, 31008, 31009, 31010, 31011, 31012, 31013, 31014, 31015, 31016, 31017, 31018, 31019, 31020, 31021, 31022, 31023, 31024, 31025, 31026, 31027, 31028, 31029, 31030, 31031, 31032, 31033, 31034, 31035, 31036, 31037, 31038, 31039, 31040, ...], 'Angelo Travis': [57258, 57259, 57260, 57261, 57262, 57263, 57264, 57265, 57266, 57267, 57268, 57269, 57270, 57271, 57272, 57273, 57274, 57275, 57276, 57277, 57278, 57279, 57280, 57281, 57282, 57283, 57284, 57285, 57286, 57287, 57288, 57289, 57290, 57291, 57292, 57293, 57294, 57295, 57296, 57297, 57298, 57299, 57300, 57301, 57302, 57303, 57304, 57305, 57306, 57307, 57308, 57309, 57310, 57311, 57312, 57313, 57314, 57315, 57316, 57317, 57318, 57319, 57320, 57321, 57322, 57323, 57324, 57325, 57326, 57327, 57328, 57329, 57330, 57331, 57332, 57333, 57334, 57335, 57336, 57337, 57338, 57339, 57340, 57341, 57342, 57343, 57344, 57345, 57346, 57347, 57348, 57349, 57350, 57351, 57352, 57353, 57354, 57355, 57356, 57357, ...], 'Annette Every': [94427, 94428, 94429, 94430, 94431, 94432, 94433, 94434, 94435, 94436, 94437, 94438, 94439, 94440, 94441, 94442, 94443, 94444, 94445, 94446, 94447, 94448, 94449, 94450, 94451, 94452, 94453, 94454, 94455, 94456, 94457, 94458, 94459, 94460, 94461, 94462, 94463, 94464, 94465, 94466, 94467, 94468, 94469, 94470, 94471, 94472, 94473, 94474, 94475, 94476, 94477, 94478, 94479, 94480, 94481, 94482, 94483, 94484, 94485, 94486, 94487, 94488, 94489, 94490, 94491, 94492, 94493, 94494, 94495, 94496, 94497, 94498, 94499, 94500, 94501, 94502, 94503, 94504, 94505, 94506, 94507, 94508, 94509, 94510, 94511, 94512, 94513, 94514, 94515, 94516, 94517, 94518, 94519, 94520, 94521, 94522, 94523, 94524, 94525, 94526, ...], 'Anthony Ennis': [24432, 24433, 24434, 24435, 24436, 24437, 24438, 24439, 24440, 24441, 24442, 24443, 24444, 24445, 24446, 24447, 24448, 24449, 24450, 24451, 24452, 24453, 24454, 24455, 24456, 24457, 24458, 24459, 24460, 24461, 24462, 24463, 24464, 24465, 24466, 24467, 24468, 24469, 24470, 24471, 24472, 24473, 24474, 24475, 24476, 24477, 24478, 24479, 24480, 24481, 24482, 24483, 24484, 24485, 24486, 24487, 24488, 24489, 24490, 24491, 24492, 24493, 24494, 24495, 24496, 24497, 24498, 24499, 24500, 24501, 24502, 24503, 24504, 24505, 24506, 24507, 24508, 24509, 24510, 24511, 24512, 24513, 24514, 24515, 24516, 24517, 24518, 24519, 24520, 24521, 24522, 24523, 24524, 24525, 24526, 24527, 24528, 24529, 24530, 24531, ...], 'Anthony Rosario': [34657, 34658, 34659, 34660, 34661, 34662, 34663, 34664, 34665, 34666, 34667, 34668, 34669, 34670, 34671, 34672, 34673, 34674, 34675, 34676, 34677, 34678, 34679, 34680, 34681, 34682, 34683, 34684, 34685, 34686, 34687, 34688, 34689, 34690, 34691, 34692, 34693, 34694, 34695, 34696, 34697, 34698, 34699, 34700, 34701, 34702, 34703, 34704, 34705, 34706, 34707, 34708, 34709, 34710, 34711, 34712, 34713, 34714, 34715, 34716, 34717, 34718, 34719, 34720, 34721, 34722, 34723, 34724, 34725, 34726, 34727, 34728, 34729, 34730, 34731, 34732, 34733, 34734, 34735, 34736, 34737, 34738, 34739, 34740, 34741, 34742, 34743, 34744, 34745, 34746, 34747, 34748, 34749, 34750, 34751, 34752, 34753, 34754, 34755, 34756, ...], 'Arlene Collier': [1785, 1786, 1787, 1788, 1789, 1790, 1791, 1792, 1793, 1794, 1795, 1796, 1797, 1798, 1799, 1800, 1801, 1802, 1803, 1804, 1805, 1806, 1807, 1808, 1809, 1810, 1811, 1812, 1813, 1814, 1815, 1816, 1817, 1818, 1819, 1820, 1821, 1822, 1823, 1824, 1825, 1826, 1827, 1828, 1829, 1830, 1831, 1832, 1833, 1834, 1835, 1836, 1837, 1838, 1839, 1840, 1841, 1842, 1843, 1844, 1845, 1846, 1847, 1848, 1849, 1850, 1851, 1852, 1853, 1854, 1855, 1856, 1857, 1858, 1859, 1860, 1861, 1862, 1863, 1864, 1865, 1866, 1867, 1868, 1869, 1870, 1871, 1872, 1873, 1874, 1875, 1876, 1877, 1878, 1879, 1880, 1881, 1882, 1883, 1884, ...], 'Arthur Fieck': [36740, 36741, 36742, 36743, 36744, 36745, 36746, 36747, 36748, 36749, 36750, 36751, 36752, 36753, 36754, 36755, 36756, 36757, 36758, 36759, 36760, 36761, 36762, 36763, 36764, 36765, 36766, 36767, 36768, 36769, 36770, 36771, 36772, 36773, 36774, 36775, 36776, 36777, 36778, 36779, 36780, 36781, 36782, 36783, 36784, 36785, 36786, 36787, 36788, 36789, 36790, 36791, 36792, 36793, 36794, 36795, 36796, 36797, 36798, 36799, 36800, 36801, 36802, 36803, 36804, 36805, 36806, 36807, 36808, 36809, 36810, 36811, 36812, 36813, 36814, 36815, 36816, 36817, 36818, 36819, 36820, 36821, 36822, 36823, 36824, 36825, 36826, 36827, 36828, 36829, 36830, 36831, 36832, 36833, 36834, 36835, 36836, 36837, 36838, 36839, ...], 'Arthur Koehler': [57190, 57191, 57192, 57193, 57194, 57195, 57196, 57197, 57198, 57199, 57200, 57201, 57202, 57203, 57204, 57205, 57206, 57207, 57208, 57209, 57210, 57211, 57212, 57213, 57214, 57215, 57216, 57217, 57218, 57219, 57220, 57221, 57222, 57223, 57224, 57225, 57226, 57227, 57228, 57229, 57230, 57231, 57232, 57233, 57234, 57235, 57236, 57237, 57238, 57239, 57240, 57241, 57242, 57243, 57244, 57245, 57246, 57247, 57248, 57249, 57250, 57251, 57252, 57253, 57254, 57255, 57256, 57257], 'Arthur Owens': [65716, 65717, 65718, 65719, 65720, 65721, 65722, 65723, 65724, 65725, 65726, 65727, 65728, 65729, 65730, 65731, 65732, 65733, 65734, 65735, 65736, 65737, 65738, 65739, 65740, 65741, 65742, 65743, 65744, 65745, 65746, 65747, 65748, 65749, 65750, 65751, 65752, 65753, 65754, 65755, 65756, 65757, 65758, 65759, 65760, 65761, 65762, 65763, 65764, 65765, 65766, 65767, 65768, 65769, 65770, 65771, 65772, 65773, 65774, 65775, 65776, 65777, 65778, 65779, 65780, 65781, 65782, 65783, 65784, 65785, 65786, 65787, 65788, 65789, 65790, 65791, 65792, 65793, 65794, 65795, 65796, 65797, 65798, 65799, 65800, 65801, 65802, 65803, 65804, 65805, 65806, 65807, 65808, 65809, 65810, 65811, 65812, 65813, 65814, 65815, ...], 'Barbara Eaton': [7045, 7046, 7047, 7048, 7049, 7050, 7051, 7052, 7053, 7054, 7055, 7056, 7057, 7058, 7059, 7060, 7061, 7062, 7063, 7064, 7065, 7066, 7067, 7068, 7069, 7070, 7071, 7072, 7073, 7074, 7075, 7076, 7077, 7078, 7079, 7080, 7081, 7082, 7083, 7084, 7085, 7086, 7087, 7088, 7089, 7090, 7091, 7092, 7093, 7094, 7095, 7096, 7097, 7098, 7099, 7100, 7101, 7102, 7103, 7104, 7105, 7106, 7107, 7108, 7109, 7110, 7111, 7112, 7113, 7114, 7115, 7116, 7117, 7118, 7119, 7120, 7121, 7122, 7123, 7124, 7125, 7126, 7127, 7128, 7129, 7130, 7131, 7132, 7133, 7134, 7135, 7136, 7137, 7138, 7139, 7140, 7141, 7142, 7143, 7144, ...], 'Barbara Glasco': [30783, 30784, 30785, 30786, 30787, 30788, 30789, 30790, 30791, 30792, 30793, 30794, 30795, 30796, 30797, 30798, 30799, 30800, 3080

In [294]:
temp = pd.read_excel('groups.xlsx',usecols=['ID','Names','Grades','Depts','Salaries'])

In [295]:
temp

    ID    Names  Grades        Depts  Salaries
0    1     Asad      16     Accounts       100
1    2    Fahad      17     Taxation       123
2    3    Saima      18     Accounts       121
3    4   Afzal       19     Taxation        98
4    5   Yasir       16  Information        99
5    6   Nasir       19     Defence        100
6    7  Husain       14     Accounts       123
7    8  Hassan       17  Information       122
8    9     Jami      17     Defence        156
9   10    Haseb      18     Accounts       160
10  11    Ahmed      16     Accounts       456

In [296]:
temp_gp_depts = temp.groupby('Depts')

In [297]:
temp_gp_depts.groups

{'Accounts': [0, 2, 6, 9, 10], 'Defence ': [5, 8], 'Information': [4, 7], 'Taxation': [1, 3]}

In [298]:
temp_gp_depts.get_group('Accounts')

    ID    Names  Grades     Depts  Salaries
0    1     Asad      16  Accounts       100
2    3    Saima      18  Accounts       121
6    7  Husain       14  Accounts       123
9   10    Haseb      18  Accounts       160
10  11    Ahmed      16  Accounts       456

In [299]:
temp_gp_depts.get_group('Defence ')

   ID   Names  Grades     Depts  Salaries
5   6  Nasir       19  Defence        100
8   9    Jami      17  Defence        156

In [300]:
df.head()

,sales_rep,Sales Rep Id,company_name,Company Id,Order Id,Date,order_value,Converted
0,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,HZSXLI1IS9RGABZW,2017-10-13,6952,0
1,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,582WPS3OW8T6YT0R,2017-09-02,7930,0
2,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,KRF65MQZBOYG4Y9T,2016-12-21,5538,1
3,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,N3EDZ5V1WGSWW828,2018-06-03,1113,0
4,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,QXBC8COXEXGFSPLP,2014-07-26,4596,0

In [301]:
df.groupby('company_name')['Converted'].count().sort_values(ascending=False).index[0]

'80Th Scorecard'

In [302]:
df.groupby('company_name')['Converted'].count().sort_values(ascending=True).index[0]

'Above-Noted Flanders'

In [303]:
df[df.Converted==1].groupby('company_name')['Converted'].count().sort_values(ascending=False).index[0]

'Canny Pompousness'

In [304]:
df[df.Converted==1].groupby('company_name')['Converted'].count().sort_values(ascending=True).index[0]

'Separable Owls'

In [305]:
df[df.Converted==0].groupby('company_name')['Converted'].count().sort_values(ascending=False).index[0]

'Contemporary Gardenia'

In [306]:
df[df.Converted==0].groupby('company_name')['Converted'].count().sort_values(ascending=True).index[0]

'Above-Noted Flanders'

In [ ]:
# Who is most successful sales man in pitching the sales
# who is most successful sales man in succesful pitches
# most successful sales man in term of order values
# Average order values of all the sales man of successful pitches

In [334]:
df[df.Converted==1].groupby('sales_rep')['order_value'].mean().sort_values(ascending=False).iloc[0:1]

sales_rep
Simon Hearn    8351.0
Name: order_value, dtype: float64

In [319]:
dual_gp = temp.groupby(["Grades", "Depts"])

In [324]:
dual_gp.groups

{(14, 'Accounts'): [6], (16, 'Accounts'): [0, 10], (16, 'Information'): [4], (17, 'Defence '): [8], (17, 'Information'): [7], (17, 'Taxation'): [1], (18, 'Accounts'): [2, 9], (19, 'Defence '): [5], (19, 'Taxation'): [3]}

In [327]:
dual_gp.get_group((16,'Accounts'))

    ID  Names  Grades     Depts  Salaries
0    1   Asad      16  Accounts       100
10  11  Ahmed      16  Accounts       456

In [329]:
df.groupby(['Converted', 'sales_rep'])['order_value'].mean()

Converted  sales_rep
0          Aaron Hendrickson    5415.158537
           Adam Sawyer          4863.489130
           Adele Kimmel         4466.052632
           Adrian Daugherty     5000.213836
           Adrianna Shelton     5029.758621
                                   ...
1          Willie Lin           5334.666667
           Willie Rau           4884.842105
           Willie Sanchez       5187.942308
           Yvonne Jones         6989.416667
           Yvonne Lindsey       4722.555556
Name: order_value, Length: 998, dtype: float64

In [337]:
df.groupby(['sales_rep','Converted'])['order_value'].mean().sort_values(ascending=False)[0:1]

sales_rep    Converted
Simon Hearn  1            8351.0
Name: order_value, dtype: float64

In [339]:
# Every sales man's max sale
df.groupby("sales_rep")['order_value'].agg(max)

sales_rep
Aaron Hendrickson    9973
Adam Sawyer          9995
Adele Kimmel         9640
Adrian Daugherty     9988
Adrianna Shelton     9170
                     ...
Willie Lin           9959
Willie Rau           9949
Willie Sanchez       9989
Yvonne Jones         9949
Yvonne Lindsey       9788
Name: order_value, Length: 499, dtype: int64

In [342]:
df.groupby("sales_rep")['order_value'].agg(np.mean)

sales_rep
Aaron Hendrickson    5310.301370
Adam Sawyer          4900.703704
Adele Kimmel         4585.556522
Adrian Daugherty     4989.902439
Adrianna Shelton     5044.621622
                        ...
Willie Lin           5775.636364
Willie Rau           4578.084211
Willie Sanchez       4936.016181
Yvonne Jones         5626.864865
Yvonne Lindsey       4840.805970
Name: order_value, Length: 499, dtype: float64

In [345]:
df.groupby("sales_rep")['order_value'].agg(np.min)

sales_rep
Aaron Hendrickson    191
Adam Sawyer          118
Adele Kimmel         152
Adrian Daugherty     105
Adrianna Shelton     169
                    ...
Willie Lin           326
Willie Rau           206
Willie Sanchez       118
Yvonne Jones         321
Yvonne Lindsey       144
Name: order_value, Length: 499, dtype: int64

In [349]:
df.groupby('sales_rep').agg(
                            {'Order Id':'count',
                             'order_value':['sum','mean'],
                             'Sales Rep Id':'count'
                            }
                            )

                  Order Id order_value              Sales Rep Id
                     count         sum         mean        count
sales_rep
Aaron Hendrickson      292     1550608  5310.301370          292
Adam Sawyer            324     1587828  4900.703704          324
Adele Kimmel           115      527339  4585.556522          115
Adrian Daugherty       369     1841274  4989.902439          369
Adrianna Shelton        37      186651  5044.621622           37
...                    ...         ...          ...          ...
Willie Lin              44      254128  5775.636364           44
Willie Rau              95      434918  4578.084211           95
Willie Sanchez         309     1525229  4936.016181          309
Yvonne Jones            74      416388  5626.864865           74
Yvonne Lindsey          67      324334  4840.805970           67

[499 rows x 4 columns]

In [363]:
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","PySpark","Spark","Spark"],
    'Fee' :[20000,25000,26000,22000,25000,20000,35000],
    'Duration':['30day','40days','35days','40days','60days','60days','70days'],
    'Discount':[1000,2300,1200,2500,2000,2000,3000]
              }

df2 = pd.DataFrame(technologies)
print("Create DataFrame:\n", df2)

Create DataFrame:
    Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000   35days      1200
3   Python  22000   40days      2500
4  PySpark  25000   60days      2000
5    Spark  20000   60days      2000
6    Spark  35000   70days      3000

In [364]:
# Groupby multiple columns
result = df2.groupby(['Courses','Fee']).count()
print("After grouping by multiple columns:\n", result)

After grouping by multiple columns:
                Duration  Discount
Courses Fee
Hadoop  26000         1         1
PySpark 25000         2         2
Python  22000         1         1
Spark   20000         2         2
        35000         1         1

In [365]:
# Group by multiple columns and get 
# count of one of grouping column
result = df2.groupby(['Courses','Fee'])['Courses'].count()
print("Get count of one of the grouping column:\n", result)

Get count of one of the grouping column:
 Courses  Fee
Hadoop   26000    1
PySpark  25000    2
Python   22000    1
Spark    20000    2
         35000    1
Name: Courses, dtype: int64

In [366]:
# Groupby multiple columns and aggregate()
result = df2.groupby(['Courses','Fee'])['Courses'].aggregate('count')
print("After grouping by multiple columns:\n", result)

After grouping by multiple columns:
 Courses  Fee
Hadoop   26000    1
PySpark  25000    2
Python   22000    1
Spark    20000    2
         35000    1
Name: Courses, dtype: int64

In [367]:
# Groupby & multiple aggregations
result = df2.groupby('Courses')['Fee'].aggregate(['min','max'])
print("After applying multiple aggregations on multiple group columns:\n", result)

After applying multiple aggregations on multiple group columns:
            min    max
Courses
Hadoop   26000  26000
PySpark  25000  25000
Python   22000  22000
Spark    20000  35000

In [368]:
# Groupby multiple columns & multiple aggregations
result = df2.groupby('Courses').aggregate({'Duration':'count','Fee':['min','max']})
print("After applying multiple aggregations on single group column:\n", result)

After applying multiple aggregations on single group column:
         Duration    Fee
           count    min    max
Courses
Hadoop         1  26000  26000
PySpark        2  25000  25000
Python         1  22000  22000
Spark          3  20000  35000

https://sparkbyexamples.com/pandas/pandas-groupby-multiple-columns/#google_vignette

In [369]:
df.head()

,Sales Rep,Sales Rep Id,Company Name,Company Id,Order Id,Date,Order Value,Converted
0,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,HZSXLI1IS9RGABZW,2017-10-13,6952,0
1,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,582WPS3OW8T6YT0R,2017-09-02,7930,0
2,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,KRF65MQZBOYG4Y9T,2016-12-21,5538,1
3,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,N3EDZ5V1WGSWW828,2018-06-03,1113,0
4,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD,QXBC8COXEXGFSPLP,2014-07-26,4596,0

In [381]:
df.groupby(pd.Grouper(key='Date',freq='Y')).size()

Date
2014-12-31    19956
2015-12-31    20054
2016-12-31    20133
2017-12-31    20079
2018-12-31    19778
Freq: A-DEC, dtype: int64

https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases